[
  {
    "id": "yoga_intro_001",
    "title": "What is Yoga - Definition and Etymology",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "introduction",
    "difficulty": "beginner",
    "duration": "knowledge",
    "info": "Yoga is an invaluable gift of ancient Indian tradition. It is essentially a spiritual discipline based on an extremely subtle science which focuses on bringing harmony between mind and body. It is an art and science for healthy living. The word 'Yoga' is derived from the Sanskrit root 'yuj' meaning 'to join', 'to yoke' or 'to unite'. According to Yogic scriptures, the practice of Yoga leads to the union of individual consciousness with universal consciousness. One who experiences this oneness of existence is said to be 'in Yoga' and is termed as a yogi who has attained a state of freedom, referred to as mukti, nirvāna, kaivalya or moksha.",
    "benefits": "Embodies unity of mind and body. Promotes harmony between thought and action. Creates restraint and fulfillment. Establishes harmony between man and nature. Provides holistic approach to health and well-being. Leads to discovery of oneness with ourselves, the world and Nature. Helps overcome all kinds of sufferings. Leads to sense of freedom in every walk of life with holistic health, happiness and harmony.",
    "precautions": "Yoga is not a substitute for medical advice. Consult healthcare provider before practicing if you have any medical conditions. Practice under guidance of qualified teacher, especially as beginner."
  },
  {
    "id": "yoga_intro_002",
    "title": "History and Development of Yoga",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "introduction",
    "difficulty": "beginner",
    "duration": "knowledge",
    "info": "The science of Yoga has its origin thousands of years ago, long before the first religion or belief systems were born. According to Yogic lore, Shiva is seen as the first yogi (ādiyogi) and the first guru (ādiguru). Several thousand years ago, on the banks of lake Kantisarovar in the Himalayas, ādiyogi poured his profound knowledge into the legendary saptarishis or 'seven sages'. Yoga is widely considered as an immortal cultural outcome of the Indus Saraswati Valley Civilisation dating back to 2700 BC. Though Yoga was being practiced in the pre-Vedic period, the great sage Maharishi Patanjali systematised and codified the then existing Yogic practices through Patanjali's Yoga Sutras.",
    "benefits": "Rich historical tradition spanning over 4700 years. Global spread through teachings of eminent masters. Prevention of disease and promotion of health. Management of lifestyle-related disorders. Millions of practitioners worldwide benefiting from practice.",
    "precautions": "Practice authentic yoga from qualified teachers. Be aware of historical context and traditional practices."
  },
  {
    "id": "yoga_fundamentals_001",
    "title": "Four Fundamental Paths of Yoga",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "fundamentals",
    "difficulty": "beginner",
    "duration": "knowledge",
    "info": "Yoga works on the level of one's body, mind, emotion and energy. This has given rise to four broad classifications: Karma Yoga where we utilise the body; Jnāna Yoga where we utilise the mind; Bhakti Yoga where we utilise the emotion; and Kriya Yoga where we utilise the energy. Each system of Yoga we practice falls within the gamut of one or more of these categories. Every individual is a unique combination of these four factors. Only a guru (teacher) can advocate the appropriate combination of the four fundamental paths as is necessary for each seeker.",
    "benefits": "Comprehensive approach addressing all aspects of being. Personalized path suited to individual constitution. Holistic development of body, mind, emotion and energy. Balanced spiritual growth.",
    "precautions": "Essential to work under direction of a qualified guru. Individual assessment needed for appropriate path. Avoid rigid adherence to single path without guidance."
  },
  {
    "id": "yoga_practices_001",
    "title": "Eight Limbs of Yoga - Ashtanga Yoga",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "fundamentals",
    "difficulty": "intermediate",
    "duration": "knowledge",
    "info": "The widely practiced Yoga sadhanas include: Yama (restraints), Niyama (observances), Āsana (postures), Prānāyāma (breath control), Pratyāhara (sense withdrawal), Dhārana (concentration), Dhyāna (meditation), and Samādhi (integration/absorption). Yamas and Niyamas are considered pre-requisites for further Yogic practices. Āsanas bring about stability of body and mind. Prānāyāma consists of developing awareness and regulation of respiration. Pratyāhara is withdrawal from sense organs. Dhārana is concentration. Dhyāna is meditation and contemplation. Samādhi is complete integration.",
    "benefits": "Complete systematic approach to yoga. Progressive development from ethics to enlightenment. Stable body and mind through asanas. Mind control through pranayama. Inner awareness through pratyahara. Enhanced concentration through dharana. Deep meditation through dhyana. Ultimate freedom through samadhi.",
    "precautions": "Practice eight limbs systematically under guidance. Don't skip ethical foundations (Yama/Niyama). Build strong asana foundation before advanced practices. Pranayama requires proper instruction."
  },
  {
    "id": "yoga_guidelines_001",
    "title": "General Guidelines - Before Practice",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "guidelines",
    "difficulty": "beginner",
    "duration": "preparation",
    "info": "Śauca (cleanliness) is an important prerequisite - includes cleanliness of surroundings, body and mind. Practice in calm and quiet atmosphere with relaxed body and mind. Practice on empty stomach or light stomach. Consume small amount of honey in lukewarm water if feeling weak. Bladder and bowels should be empty before starting. Use mattress, Yoga mat, durrie or folded blanket. Wear light and comfortable cotton clothes to facilitate easy movement. Do not perform in state of exhaustion, illness, hurry or acute stress. In case of chronic disease, pain, cardiac problems, consult physician or Yoga therapist before practicing. Consult experts before practicing during pregnancy and menstruation.",
    "benefits": "Safe and effective practice. Maximum benefits from session. Prevents injury and discomfort. Creates conducive environment for practice. Proper preparation of body and mind.",
    "precautions": "Contraindications: Exhaustion, illness, hurry, acute stress. Mandatory medical consultation for: chronic disease, pain, cardiac problems, pregnancy, menstruation. Never practice on full stomach. Ensure clean, quiet environment."
  },
  {
    "id": "yoga_guidelines_002",
    "title": "General Guidelines - During Practice",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "guidelines",
    "difficulty": "beginner",
    "duration": "practice",
    "info": "Start with prayer or invocation to create conducive environment and relax mind. Perform slowly, in relaxed manner, with awareness of body and breath. Do not hold breath unless specially mentioned. Breathing should always be through nostrils unless instructed otherwise. Do not hold body tightly or jerk the body. Perform according to your own capacity. Takes time to get good results - persistent and regular practice is essential. Be aware of contra-indications and limitations for each practice. Session should end with meditation, deep silence or Śhānti paṭha (peace chant).",
    "benefits": "Safe practice with body awareness. Proper breathing patterns. Prevention of injury. Gradual progress at own pace. Mental relaxation and focus. Integration of practice benefits.",
    "precautions": "Never force or strain. Respect body's current capacity. Maintain breath awareness throughout. Follow specific contraindications for each pose. End practice properly for integration."
  },
  {
    "id": "yoga_guidelines_003",
    "title": "General Guidelines - After Practice",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "guidelines",
    "difficulty": "beginner",
    "duration": "post-practice",
    "info": "Bath may be taken only after 20-30 minutes of practice. Food may be consumed only after 20-30 minutes of practice. This allows body to settle and normalize after practice. For dietary guidelines: vegetarian diet is usually recommended. For persons over 30 years, two meals a day should suffice, except in cases of illness or very high physical activity or labour.",
    "benefits": "Proper integration of practice effects. Body temperature normalization. Energy settling. Optimal digestion. Enhanced practice benefits through proper timing.",
    "precautions": "Wait 20-30 minutes before bathing. Wait 20-30 minutes before eating. Avoid rushing after practice. Allow body time to adjust."
  },
  {
    "id": "yoga_benefits_001",
    "title": "How Yoga Can Help - Health Benefits",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "benefits",
    "difficulty": "beginner",
    "duration": "knowledge",
    "info": "Medical research has uncovered many physical and mental benefits that Yoga offers. Yoga is beneficial for physical fitness, musculoskeletal functioning and cardio-vascular health. Beneficial in management of diabetes, respiratory disorders, hypertension, hypotension and many lifestyle-related disorders. Helps to reduce depression, fatigue, anxiety disorders and stress. Regulates menopausal symptoms. In essence, Yoga is a process of creating a body and mind that are stepping-stones, not hurdles, to an exuberant and fulfilling life.",
    "benefits": "Physical fitness improvement. Enhanced musculoskeletal function. Cardiovascular health. Diabetes management. Respiratory disorder relief. Blood pressure regulation. Reduced depression and anxiety. Stress relief. Fatigue reduction. Menopausal symptom regulation. Disease prevention. Health promotion. Lifestyle disorder management.",
    "precautions": "Yoga complements but doesn't replace medical treatment. Consult healthcare provider for serious conditions. Practice appropriately for specific health issues."
  },
  {
    "id": "yoga_prayer_001",
    "title": "Opening Prayer - Saṃgacchadhvam",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Rigveda 10.191.2",
    "category": "prayer",
    "difficulty": "beginner",
    "duration": "1-2 minutes",
    "info": "Yogic Practice shall start with a prayer or prayerful mood to enhance benefits of practice. Sanskrit: Saṃgacchadhvaṃ saṃvadadhvaṃ saṃ vo manāṃsi jānatām, devā bhāgaṃ yathā pūrve sañjānānā upāsate. Translation: May you move in harmony; may you speak in unison; let our mind be equanimous like in the beginning; let the divinity manifest in your sacred endeavours.",
    "benefits": "Creates conducive environment to relax mind. Sets intention for practice. Establishes mental calm. Connects to tradition. Invokes divine blessings. Promotes harmony and unity. Prepares mind for deeper practice.",
    "precautions": "None. Prayer is optional but recommended. Can be recited mentally or aloud. Respect the sacred intention."
  },
  {
    "id": "yoga_loosening_001",
    "title": "Neck Bending - Griva Sanchalan",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "loosening_practices",
    "difficulty": "beginner",
    "duration": "2-3 minutes",
    "info": "Starting Position: Samasthiti (feet comfortably apart, hands beside body). Stage 1 - Forward/Backward: Exhale and move head forward touching chin to chest. Inhale and move head back comfortably. Repeat 2 rounds. Stage 2 - Right/Left Bending: Exhale and bend head to right bringing ear toward shoulder without raising shoulder. Inhale return to normal. Repeat other side. 2 rounds each. Stage 3 - Right/Left Twisting: Exhale and turn head right bringing chin in line with shoulder. Inhale return. Repeat left. 2 rounds. Stage 4 - Neck Rotation: Exhale bend head forward. Inhale and rotate head clockwise in full circular motion. Repeat anti-clockwise. 2 rounds each direction.",
    "benefits": "Loosens neck joints and muscles. Relieves tension from poor posture. Increases microcirculation. Improves neck flexibility and range of motion. Reduces stiffness. Prepares for asana practice.",
    "precautions": "Contraindications: Cervical spondylitis, high blood pressure, vertigo (elderly should avoid). Move only as far as comfortable without overstrain. Keep shoulders relaxed and steady. Can be practiced sitting in chair. People with neck pain should practice gently, especially when taking head back."
  },
  {
    "id": "yoga_loosening_002",
    "title": "Trunk Twisting - Katishakti Vikasak",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "loosening_practices",
    "difficulty": "beginner",
    "duration": "1-2 minutes",
    "info": "Starting Position: Samasthiti with legs 2-3 feet apart. Rise both arms to chest level with palms facing each other, parallel. Exhale and twist body to left so right palm touches left shoulder. Inhale return to center. Exhale twist right so left palm touches right shoulder. Inhale return. This is one round - repeat two more times. Relax in Samasthiti.",
    "benefits": "Improves spine flexibility. Loosens trunk muscles. Increases microcirculation. Prepares spine for twisting asanas. Massages abdominal organs. Reduces waist fat.",
    "precautions": "Contraindications: Severe back pain, vertebral and disc disorders, after abdominal surgery, during menstruation. Do slowly with breathing coordination. Cardiac patients shall do with care."
  },
  {
    "id": "yoga_loosening_003",
    "title": "Knee Movement - Knee Bending",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "loosening_practices",
    "difficulty": "beginner",
    "duration": "1-2 minutes",
    "info": "Starting Position: Samasthiti. Inhale and lift arms to shoulder level, palms facing down. Exhale and bend knees bringing body to squatting position. In final position both arms and thighs should be parallel to ground. Inhale and straighten body. Exhale while bringing hands down. Repeat two more times.",
    "benefits": "Strengthens knee joints and hip joints. Improves lower body strength. Increases leg flexibility. Prepares legs for standing asanas. Enhances balance.",
    "precautions": "Contraindications: Acute arthritis conditions. Avoid if experiencing knee pain. Don't bend beyond comfortable range. Keep knees aligned over toes."
  },
  {
    "id": "yoga_asana_001",
    "title": "Tādāsana - Palm Tree Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "standing_asana",
    "difficulty": "beginner",
    "duration": "10-15 seconds hold",
    "info": "Tāda means palm tree or mountain. This asana teaches attaining stability and firmness and forms base for all standing asanas. Stand with feet 2 inches apart. Interlock fingers and turn wrists outward. Inhale, raise arms up in line with shoulders. Raise heels off floor and balance on toes. Stay 10-15 seconds. Exhale, bring heels down. Release interlock and bring arms down parallel to trunk. Return to standing posture.",
    "benefits": "Brings stability in body. Clears up congestion of spinal nerves. Corrects faulty posture. Helps increase height up to certain age. Improves balance and concentration. Strengthens legs and ankles. Stretches entire body. Develops body awareness.",
    "precautions": "Contraindications: Acute cardiac problems, varicose veins, vertigo. Avoid lifting toes in these conditions. Practice near wall for balance support if needed."
  },
  {
    "id": "yoga_asana_002",
    "title": "Vṛikṣāsana - Tree Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "standing_asana",
    "difficulty": "beginner",
    "duration": "10-30 seconds each side",
    "info": "Vṛkṣa means tree. Final position resembles shape of tree. Stand with feet 2 inches apart. Focus on point in front. Exhale, bend right leg and place foot on inside of left thigh with heel touching perineum. Inhale and extend arms up joining palms. Stay in position 10-30 seconds breathing normally. Exhale and bring arms and right foot down. Relax and repeat with left leg.",
    "benefits": "Improves neuro-muscular coordination, balance, endurance and alertness. Tones up leg muscles. Rejuvenates ligaments. Develops concentration and focus. Strengthens ankles and improves posture. Calms mind.",
    "precautions": "Contraindications: Arthritis, vertigo, obesity. Avoid if experiencing these conditions. Never place foot directly on knee joint. Use wall for support if balance is difficult. Can place foot on calf or ankle if thigh placement too challenging."
  },
  {
    "id": "yoga_asana_003",
    "title": "Pāda-Hastāsana - Hands to Feet Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "standing_asana",
    "difficulty": "intermediate",
    "duration": "10-30 seconds hold",
    "info": "Pāda means feet, hasta means hands. Also called Uttānāsana. Stand straight with feet 2 inches apart. Inhale slowly and raise arms up. Stretch body from waist. Exhale and bend forward until trunk is parallel to ground. Exhale and bend forward until entire palm rests on ground. Maintain final posture 10-30 seconds. Those with stiff back should bend according to capacity. Inhale, come up slowly to vertical and stretch arms above head. Exhale and return to starting position in reverse order. Relax in Tādāsana.",
    "benefits": "Makes spine flexible. Improves digestion. Prevents constipation and menstrual problems. Stretches hamstrings and back. Increases blood flow to brain. Calms nervous system. Reduces abdominal fat.",
    "precautions": "Contraindications: Cardiac or back problems, abdominal inflammation, hernia, ulcers, high myopia, vertigo, pregnancy, vertebral and disc disorders. Avoid in all these conditions. Bend only to comfortable capacity - never force. Keep knees slightly bent if hamstrings tight."
  },
  {
    "id": "yoga_asana_004",
    "title": "Ardha Cạkrāsana - Half Wheel Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "standing_asana",
    "difficulty": "intermediate",
    "duration": "10-30 seconds hold",
    "info": "Ardha means half, Cạkra means wheel. Body takes shape of half wheel. Support back at waist with fingers together pointing forward or downward. Drop head backwards stretching neck muscles. Inhale and bend backwards from lumbar region. Exhale and relax. Stay 10-30 seconds with normal breathing. Inhale and slowly come up.",
    "benefits": "Makes spine flexible. Strengthens spinal nerves. Strengthens neck muscles. Improves breathing capacity. Helps in cervical spondylitis. Opens chest and shoulders. Improves posture.",
    "precautions": "Contraindications: Vertigo or tendency to giddiness. Hypertensive patients shall bend with care and minimally. Never force backward bend. Support lower back with hands throughout. Start with small range and gradually increase."
  },
  {
    "id": "yoga_asana_005",
    "title": "Trikoṇāsana - Triangle Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "standing_asana",
    "difficulty": "beginner",
    "duration": "10-30 seconds each side",
    "info": "Trikoṇa means triangle. Tri means three and kona is angle. Asana resembles three triangles made by trunk and limbs. Stand with feet comfortably apart. Slowly raise both arms sideways till horizontal. Exhale, slowly bend to right and place right hand behind right foot. Left arm straight up in line with right arm. Turn left palm forward. Turn head and gaze at tip of left middle finger. Remain 10-30 seconds with normal breathing. Inhale slowly come up. Repeat for left side.",
    "benefits": "Prevents flat foot. Strengthens calf, thigh and waist muscles. Makes spine flexible. Improves lung capacity. Tones abdominal organs. Enhances balance and stability. Stretches hips and hamstrings.",
    "precautions": "Contraindications: Slipped disc, sciatica, after abdominal surgery. Do not overdo lateral stretch beyond limits. If cannot touch feet, reach for knees instead. Those with neck problems should look forward instead of up."
  },
  {
    "id": "yoga_asana_006",
    "title": "Bhadrāsana - Firm/Auspicious Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Hathapradipika",
    "category": "sitting_asana",
    "difficulty": "beginner",
    "duration": "Hold comfortably",
    "info": "Bhadra means firm or auspicious. Starting: Long sitting posture (Viṣrāmāsana). Sit erect with legs stretched straight in front. Keep hands beside hips - this is Dandāsana. Put soles of feet together. Exhale and clasp hands together over toes. Pull heels as close as possible to perineum region. If thighs not touching floor, place soft cushion under knees for support. This is final position. Stay for some time.",
    "benefits": "Keeps body firm and stabilizes mind. Keeps knees and hip joints healthy. Helps relieve knee pain. Acts on abdominal organs and releases abdominal tension. Benefits women by relieving abdominal pain during menstruation. Opens hips. Improves flexibility.",
    "precautions": "Contraindications: Severe arthritis, sciatica. Avoid in these conditions. Don't force knees down. Use props for support if needed. Practice gently and progressively."
  },
  {
    "id": "yoga_asana_007",
    "title": "Ardha Uṣṭrāsana - Half Camel Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "sitting_asana",
    "difficulty": "intermediate",
    "duration": "10-30 seconds hold",
    "info": "Uṣṭra means camel. Final version resembles hump of camel. This is half (ardha) version. From Viṣrāmāsana come to Dandāsana. Fold legs and sit on heels with thighs close and big toes touching. Place hands on knees. Head and back straight - this is Vajrāsana. Stand on knees. Place hands on waist with fingers pointing downward. Keep elbows and shoulders parallel. Bend head back and stretch neck muscles. Inhale and bend trunk backwards as much as possible. Exhale and relax. Keep thighs perpendicular to ground. Remain 10-30 seconds with normal breathing. Return with inhalation, sit in Vajrāsana. Relax in Viṣrāmāsana. Note: If can reach heels, place hands on them and bend backwards - this is Uṣṭrāsana.",
    "benefits": "Relieves constipation and back pain. Increases blood circulation to head and cardiac region. Opens chest and throat. Improves spinal flexibility. Stimulates digestive organs. Stretches hip flexors and quadriceps.",
    "precautions": "Contraindications: Hernia, abdominal injuries, arthritis, vertigo, pregnancy. Avoid in all these conditions. Never force into full backbend. Progress gradually. Keep thighs perpendicular to prevent strain."
  },
  {
    "id": "yoga_asana_008",
    "title": "Śaśānkāsana - Hare Posture (Child's Pose)",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Gheranda Samhita",
    "category": "sitting_asana",
    "difficulty": "beginner",
    "duration": "Hold comfortably",
    "info": "Śaśaṇka means hare. Starting: Vajrāsana. Spread both knees wide apart keeping big toes touching. Keep palms between knees. Exhale and slowly stretch them full length. Bend forward and place chin on ground. Keep arms parallel. Look in front and maintain posture. Inhale and come up. Exhale and come back to Vajrāsana. Stretch legs back to Viṣrāmāsana.",
    "benefits": "Helps reduce stress and anger. Tones up reproductive organs. Relieves constipation. Improves digestion. Relieves back pain. Calms nervous system. Massages internal organs. Promotes relaxation. Stretches spine gently.",
    "precautions": "Contraindications: Acute backache. Patients with osteoarthritis of knees should exercise with caution or avoid Vajrāsana positions. Pregnant women should keep knees wide apart. Can use blanket under knees for comfort."
  },
  {
    "id": "yoga_asana_009",
    "title": "Vakrāsana - Spinal Twist Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "sitting_asana",
    "difficulty": "intermediate",
    "duration": "10-30 seconds each side",
    "info": "Vakra means twisted. Spine is twisted which has rejuvenating effect on functioning. Starting: Dandāsana. Bend right leg and place right foot beside left knee. Exhale and twist body to right. Bring left arm around right knee and clasp right big toe or place palm beside right foot. Take right arm back and keep palm on ground with back straight. Remain 10-30 seconds with normal breathing and relax. Release hands with exhalation and relax. Repeat same on other side.",
    "benefits": "Increases flexibility of spine. Helps overcome constipation and dyspepsia. Stimulates pancreas and helps in management of diabetes. Massages abdominal organs. Improves digestion. Detoxifies spine. Energizes nervous system. Tones kidneys and liver.",
    "precautions": "Contraindications: Severe back pain, vertebral and disc disorders, after abdominal surgery, during menstruation. Avoid in these conditions. Never force twist. Twist from belly, not shoulders. Keep spine elongated throughout."
  },
  {
    "id": "yoga_asana_010",
    "title": "Bhujangāsana - Cobra Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Gheranda Samhita",
    "category": "prone_asana",
    "difficulty": "beginner",
    "duration": "Hold comfortably, 15-30 seconds",
    "info": "Bhujanga means snake or cobra. Body is raised like hood of snake. Starting: Prone posture or Makarāsana. Lie on stomach, rest head on hands and relax body. Join legs and stretch arms. Keep forehead on ground. Place hands beside body with palms and elbows on ground. Inhale slowly, lift chin and chest up to navel region. Stay comfortably - this is Sarala Bhujangāsana. Come back, place forehead on ground. Keep palms besides chest where elbows were and raise elbows. Inhale, slowly lift chin and chest up to navel region - this is Bhujangāsana. Exhale, rest forehead on ground, place palms and rest head on palms, spread legs and relax. Keep legs firm so no load on lumbar spine.",
    "benefits": "Best for stress management. Reduces abdominal fat. Alleviates constipation. Helps remove backache and bronchial problems. Strengthens spine and back muscles. Opens chest improving breathing. Stimulates abdominal organs. Improves blood circulation to spine. Therapeutic for asthma.",
    "precautions": "Contraindications: Abdominal surgery (avoid 2-3 months after), hernia, ulcers, hyperthyroid, pregnancy, serious back injury, carpal tunnel. Never push heavily with arms - lift comes from back strength. Keep elbows slightly bent. Don't strain neck by looking too far up."
  },
  {
    "id": "yoga_asana_011",
    "title": "Śalabhāsana - Locust Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Gheranda Samhita",
    "category": "prone_asana",
    "difficulty": "intermediate",
    "duration": "10-20 seconds hold",
    "info": "Śalabha means locust. Starting: Prone posture, Makarāsana. Lie on stomach in Makarāsana. Rest chin on floor. Keep both hands beside body, palms facing upwards. Inhale, raise legs off floor as much as possible without bending knees. Extend arms and legs well to ease lift of body off floor. Stay 10-20 seconds breathing normally. Exhale, bring legs down toward floor. Rest few seconds in Makarāsana. Pull up knee caps and squeeze buttocks to improve posture. More beneficial when performed after Bhujangāsana.",
    "benefits": "Helps in sciatica and lower backache. Tones hip muscles and kidney region. Reduces fat on thighs and buttocks. Good for weight management. Helps abdominal organs aiding digestion. Strengthens entire back, hips and legs. Improves lung capacity. Corrects postural defects.",
    "precautions": "Contraindications: Cardiac problems, severe lower back pain, high blood pressure, peptic ulcers, hernia, pregnancy. Avoid in all these conditions. Proceed cautiously if any back issues. Never jerk while lifting. Lift should be smooth and controlled."
  },
  {
    "id": "yoga_asana_012",
    "title": "Makarāsana - Crocodile Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "prone_asana",
    "difficulty": "beginner",
    "duration": "Relaxation pose - hold as needed",
    "info": "Makara means crocodile. Body resembles crocodile. Starting: Prone relaxation posture. Lie on stomach with feet wide apart, feet pointing outward. Bend both arms and place right hand on left hand. Place forehead on hands. Keep eyes closed. This is Makarāsana. This asana is practiced for relaxation in all prone postures.",
    "benefits": "Promotes relaxation of lower back. Helps in recovery of back problems. Indicated for all orthopedic ailments. Indicated to counter stress and anxiety. Allows spine to rest. Releases tension in shoulders and neck. Calms nervous system. Provides break between challenging prone poses.",
    "precautions": "Contraindications: Low blood pressure, severe cardiac problems, pregnancy (especially later stages). Generally very safe relaxation pose. Adjust arm position for comfort. Can turn head to either side if more comfortable."
  },
  {
    "id": "yoga_asana_013",
    "title": "Śetubandhāsana - Bridge Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Yogarahasya",
    "category": "supine_asana",
    "difficulty": "beginner",
    "duration": "10-30 seconds hold",
    "info": "Setubandha means formation of bridge. Body is positioned like bridge. Also called Catuṣpādāsana. Starting: Supine lying, Śavāsana. Bend both legs at knees and bring heels near buttocks. Hold both ankles firmly. Keep knees and feet in one straight line. Inhale, slowly raise buttocks and trunk up as much as possible to form bridge. Remain 10-30 seconds with normal breathing. Exhale, slowly return to original position and relax in Śavāsana. In final position shoulders and head remain in contact with floor. If required, can support body at waist with hands in final position.",
    "benefits": "Relieves depression and anxiety. Strengthens lower back muscles. Stretches abdominal organs, improves digestion and helps relieve constipation. Stretches chest, neck and spine. Stimulates thyroid and abdominal organs. Calms brain. Therapeutic for asthma, high blood pressure, osteoporosis. Relieves menstrual discomfort.",
    "precautions": "Contraindications: Ulcers, hernia, advanced pregnancy, neck injury. In final position shoulders and head should remain on floor. Never force lift. Can use block under sacrum for supported version."
  },
  {
    "id": "yoga_asana_014",
    "title": "Pavanamuktāsana - Wind Releasing Posture",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Shri Yoga Kaustubha",
    "category": "supine_asana",
    "difficulty": "beginner",
    "duration": "Hold comfortably",
    "info": "Pavan means wind, mukta means release or make free. Asana useful in removing wind or flatulence from stomach and intestines. Starting: Śavāsana. Lie flat on back. Bend both knees and bring thighs to chest. Interlock fingers and clasp shin below knees. Exhale, raise head till chin touches knees and relax - this is Pavanamuktāsana. Bring head back to ground. While exhaling, lower legs to floor. Rest in Śavāsana. Synchronize breathing with leg movement. While touching knee with nose/forehead, should feel lumbar region stretch. Keep eyes closed and focus attention on lumbar region.",
    "benefits": "Removes constipation. Gives relief from flatulence. Decreases bloating sensation in abdomen and aids digestion. Offers deep internal pressure, massage and stretching of muscles, ligaments and tendons in pelvis and waist region. Tones up back muscles and spinal nerves. Massages abdominal organs. Strengthens arms and legs.",
    "precautions": "Contraindications: Abdominal injuries, hernia, sciatica, severe back pain, pregnancy, slipped disc. Avoid in all these conditions. Never force chin to knees. Practice gently with awareness of lumbar region."
  },
  {
    "id": "yoga_asana_015",
    "title": "Śavāsana - Corpse Posture (Deep Relaxation)",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Gheranda Samhita",
    "category": "supine_asana",
    "difficulty": "beginner",
    "duration": "5-15 minutes",
    "info": "Sava means dead body. Final position resembles dead body. Starting: Supine Relaxation Posture. Lie on back with arms and legs comfortably apart. Palms facing upward, eyes closed. Relax whole body consciously. Become aware of natural breath and allow it to become rhythmic and slow. Remain in position till feeling refreshed and relaxed.",
    "benefits": "Helps relieve all kinds of tensions and gives rest to both body and mind. Relaxes whole psycho-physiological system. Mind which is constantly attracted to outer world takes U-turn and moves inwards, gradually getting absorbed. As mind turns quiet and absorbed, practitioner remains undisturbed by external environment. Very beneficial in management of stress and its consequences. Reduces blood pressure and heart rate. Promotes deep rest. Allows integration of practice benefits. Essential final relaxation.",
    "precautions": "Generally safe for everyone. Stay warm with blanket if needed. Some people fall asleep - this is okay but try to maintain awareness. Most important pose despite appearing simple. Pregnant women can lie on left side. Those with back issues can bend knees, feet flat on floor."
  },
  {
    "id": "yoga_pranayama_001",
    "title": "Kapālabhāti - Skull Shining Breath",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Gheranda Samhita",
    "category": "pranayama",
    "difficulty": "intermediate",
    "duration": "3 rounds of 30-60 breaths",
    "info": "Starting: Any meditative posture (Sukāsana/Padmāsana/Vajrāsana). Sit in meditative posture. Close eyes and relax whole body. Inhale deeply through both nostrils, expand chest. Expel breath with forceful contractions of abdominal muscles and relax. Do not strain. Continue active/forceful exhalation and passive inhalation. Complete 30 rapid breaths, then take deep breath and exhale slowly - this is one round. Each round followed by deep breathing. Repeat 2 more rounds. Breathing: Forceful exhalation by contracting abdominal muscles without undue movements in chest and shoulder. Inhalation passive throughout. Beginners practice up to 3 rounds of 20 breaths each. Count and rounds increased gradually over time.",
    "benefits": "Purifies frontal air sinuses. Helps overcome cough disorders. Useful in treating cold, rhinitis, sinusitis, asthma and bronchial infections. Rejuvenates whole body. Keeps face young and vibrant. Balances and strengthens nervous system. Tones up digestive system. Cleanses respiratory system. Energizes body and mind. Increases oxygen to brain. Improves concentration.",
    "precautions": "Contraindications: Cardiac conditions, giddiness, high blood pressure, vertigo, chronic nose bleeding, epilepsy, migraine, stroke, hernia, gastric ulcers, pregnancy, menstruation, recent abdominal surgery. Avoid in all these conditions. Stop if feeling dizzy. Heating practice - best in morning. Never strain or force."
  },
  {
    "id": "yoga_pranayama_002",
    "title": "Nādiśodhana/Anuloma Viloma - Alternate Nostril Breathing",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Hathapradipika",
    "category": "pranayama",
    "difficulty": "beginner",
    "duration": "5-10 rounds initially, build to 10-15 minutes",
    "info": "Main characteristic is alternate breathing through left and right nostrils without or with retention (kumbhaka). Starting: Any meditative posture. Keep spine and head straight with eyes closed. Relax body with few deep breaths. Keep left palm on left knee in Jnāna mudra. Right hand in Nāsāgra mudra. Place ring and small fingers on left nostril, fold middle and index finger. Place right thumb on right nostril. Breathe in from left nostril. Close left nostril with small and ring fingers, release thumb from right nostril, exhale through right. Next inhale through right nostril. At end of inhalation close right nostril, open left and exhale through it. This complete process is one round. Repeat 5 rounds. Ratio and timing: For beginners duration of inhalation and exhalation should be equal. Gradually make 1:2 (inhalation:exhalation). Breath should be slow, steady and controlled, not forced or restricted.",
    "benefits": "Main purpose is to purify principle channels of carrying energy (nadis), hence nourishes whole body. Induces tranquility. Helps improve concentration. Increases vitality. Lowers stress and anxiety levels. Balances left and right brain hemispheres. Calms nervous system. Improves respiratory function. Prepares mind for meditation. One of safest and most beneficial pranayamas.",
    "precautions": "Generally very safe for almost everyone. Never force breath. Maintain smooth, comfortable breathing. If feeling lightheaded, return to normal breathing. Practice on empty stomach. Can be practiced daily."
  },
  {
    "id": "yoga_pranayama_003",
    "title": "Bhrāmarī Prāṇāyāma - Bee Breath",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Hathapradipika",
    "category": "pranayama",
    "difficulty": "beginner",
    "duration": "5-10 rounds",
    "info": "Bhrāmarī derived from bhramara meaning black bee. Sound produced resembles buzzing of black bee. Starting: Any meditative posture. Type 1: Sit in meditative posture with eyes closed. Inhale deeply through nose. Exhale slowly in controlled manner while making deep, steady humming sound like black bee. This is one round. Repeat 5 rounds. Type 2: Sit in meditative posture with eyes closed. Inhale deeply through nose. Close eyes with index fingers, mouth with ring and small fingers, ears with thumbs (Śanmukhi Mudra). Exhale slowly in controlled manner while making deep, steady humming sound like black bee. This is one round. Repeat 5 rounds.",
    "benefits": "Relieves stress and helps in alleviating anxiety, anger and hyperactivity. Resonance effect of humming sound creates soothing effect on mind and nervous system. Great tranquilizer. Good in management of stress-related disorders. Useful preparatory prāṇāyāma for concentration and meditation. Instantly calms mind. Reduces blood pressure. Improves concentration and memory. Helps insomnia. Therapeutic for thyroid.",
    "precautions": "Contraindications: Nose and ear infections. Generally very safe. One of best breathing techniques for calming mind. Can be practiced anytime feeling stressed or anxious."
  },
  {
    "id": "yoga_meditation_001",
    "title": "Dhyāna in Śambhavī Mudra - Meditation",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Yoga Sutra of Patanjali",
    "category": "meditation",
    "difficulty": "intermediate",
    "duration": "Start 5-10 minutes, gradually increase",
    "info": "Dhyāna or meditation is act of continuous contemplation. Starting: Any meditative posture. Keep spine comfortably erect. Hold Jnāna mudra: Touch tip of thumb to tip of index finger forming circle. Other three fingers straight and relaxed, side-by-side and touching. Keep palms facing upwards upon thighs. Arms and shoulders loose and relaxed. Close eyes and sit with slightly upturned face. Need not concentrate. Just maintain mild focus between eyebrows and be conscious of breath. Dissolve thoughts and attain single and pure thought. Meditate. For beginners soothing music may be played in background. Stay as long as you can.",
    "benefits": "Most important component of Yoga practice. Helps practitioner eliminate negative emotions like fear, anger, depression, anxiety and develop positive emotions. Keeps mind calm and quiet. Increases concentration, memory, clarity of thought and will power. Rejuvenates whole body and mind giving proper rest. Leads to self-realization. Reduces stress profoundly. Enhances self-awareness. Improves emotional regulation. Develops witness consciousness.",
    "precautions": "No contraindications. Safe for everyone. Start with short duration and gradually increase. Don't force concentration. Allow thoughts to settle naturally. Regular practice more important than long duration. Best practiced daily at same time. Morning ideal but evening also suitable. Consistency key to progress."
  },
  {
    "id": "yoga_sankalpa_001",
    "title": "Sankalpa - Positive Resolve",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "closing",
    "difficulty": "beginner",
    "duration": "1-2 minutes",
    "info": "End Yoga Practice Session with Sankalpa. Recommended Sankalpa: I commit to make myself into healthy, peaceful, joyful and loving human being. Through every action of mine, I will strive to create peaceful and loving atmosphere around me. I strive to break limitations of who I am right now and include entire world as my own. I recognize kinship of my own life with every other life. I recognize unity of all there is.",
    "benefits": "Plants seeds of positive transformation. Aligns subconscious with conscious goals. Creates profound changes through consistent practice. Embeds practice benefits in daily life. Strengthens resolve and commitment. Promotes universal consciousness and compassion. Extends personal practice to world service.",
    "precautions": "State in present tense as if already true. Keep brief and clear. Should be emotionally resonant and personally meaningful. Repeat consistently. Best stated when mind is relaxed after practice. Can create personal sankalpa relevant to individual goals."
  },
  {
    "id": "yoga_shanti_001",
    "title": "Śāntih Pātha - Peace Invocation",
    "source": "Common Yoga Protocol - Ministry of AYUSH, Government of India",
    "category": "closing",
    "difficulty": "beginner",
    "duration": "1-2 minutes",
    "info": "Shanti Patha or Peace Chant concludes yoga practice. Sanskrit: Sarve Bhavantu Sukhinah, Sarve Santu Nirāmayāh. Sarve Bhadrāṇi Paśyantu, Mā kaścit Duḥkha Bhāgbhavet. Om Śāntiḥ Śāntiḥ Śāntiḥ. Translation: May All become Happy, May All be Free from Illness. May All See what is Auspicious, May no one Suffer. Om Peace, Peace, Peace. Three repetitions of Shanti represent: Adhibhautika (peace with external world and beings), Adhidaivika (peace with nature and divine), Adhyatmika (inner peace within oneself).",
    "benefits": "Extends wishes of wellbeing to all beings. Embodies yoga's principle that individual wellbeing interconnected with universal wellbeing. Transcends ego boundaries. Aligns with highest yogic ideals of compassion and unity. Cultivates genuine benevolence. Reminds that practice serves collective peace and harmony. Creates positive vibrations. Concludes practice on universal note.",
    "precautions": "No contraindications. Can be chanted or repeated silently. Understand and feel the meaning while chanting. Can be chanted in Sanskrit, transliteration, or translation. Intention and feeling most important."
  },
  {
    "id": "yoga_101",
    "title": "Bhastrika Pranayama - Bellows Breath",
    "source": "Traditional Hatha Yoga",
    "category": "pranayama",
    "difficulty": "intermediate",
    "duration": "5-10 minutes",
    "info": "Bhastrika is a powerful energizing breath technique that resembles the bellows of a blacksmith. Sit in a comfortable meditative posture with spine erect. Take a deep inhalation through both nostrils, expanding the chest. Immediately follow with a forceful exhalation through both nostrils. Unlike Kapalabhati, both inhalation and exhalation are active and forceful. The breath should be rapid but rhythmic. Start with 10 breaths per round, gradually increasing to 20-30. Practice 3 rounds with rest between each. The sound should resemble a blacksmith's bellows - strong and steady.",
    "benefits": "Powerfully energizes the entire body and mind. Increases metabolic rate and generates internal heat. Strengthens respiratory system and increases lung capacity. Oxygenates blood thoroughly. Clears nasal passages and sinuses. Stimulates digestive fire (Agni). Prepares body and mind for meditation. Balances all three doshas in Ayurveda. Awakens dormant energy and vitality.",
    "precautions": "Contraindications: Pregnancy, menstruation, high blood pressure, heart disease, hernia, gastric ulcer, epilepsy, recent abdominal surgery, fever, vertigo, detached retina, glaucoma. Practice only under expert guidance initially. Stop if you feel dizzy, nauseous, or overheated. This is a heating practice - best performed in morning or cool weather."
  },
  {
    "id": "yoga_102",
    "title": "Viloma Pranayama - Interrupted Breath",
    "source": "Iyengar Yoga Tradition",
    "category": "pranayama",
    "difficulty": "intermediate",
    "duration": "10-15 minutes",
    "info": "Viloma means 'against the natural order.' This technique involves pausing during inhalation or exhalation. Stage 1 - Interrupted Inhalation: Inhale for 2 seconds, pause for 2 seconds with lungs partially full. Continue inhaling in stages until lungs are completely full. Exhale smoothly and completely. Stage 2 - Interrupted Exhalation: Inhale smoothly and completely. Exhale for 2 seconds, pause for 2 seconds with lungs partially empty. Continue exhaling in stages until lungs are completely empty. Practice 5-10 rounds of each stage. This technique requires precise control and awareness of breath.",
    "benefits": "Develops exceptional breath control and awareness. Increases lung capacity gradually. Strengthens respiratory muscles. Calms nervous system profoundly. Excellent for anxiety and stress relief. Improves focus and concentration. Prepares for advanced pranayama practices. Helps manage respiratory conditions like asthma when practiced gently.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort. Avoid if you have severe respiratory problems. Never force the breath or create strain. If dizzy, return to normal breathing immediately."
  },
  {
    "id": "yoga_103",
    "title": "Sama Vritti - Equal Breathing (Box Breathing)",
    "source": "Classical Yoga",
    "category": "pranayama",
    "difficulty": "beginner",
    "duration": "5-10 minutes",
    "info": "Sama Vritti means 'equal fluctuation' referring to equal duration for all parts of the breath cycle. Sit comfortably with spine erect. Begin by establishing a natural breath rhythm. Then make inhalation and exhalation equal in length - start with a count of 4. Inhale for 4 counts, exhale for 4 counts. Once comfortable, add retention: Inhale for 4, hold for 4, exhale for 4, hold empty for 4. This creates a 'box' pattern. Gradually increase count to 6 or 8 as capacity develops. Maintain smooth, comfortable breathing throughout.",
    "benefits": "Creates mental and emotional balance. Reduces anxiety and stress immediately. Improves focus and concentration. Regulates nervous system. Balances left and right brain hemispheres. Prepares mind for meditation. Used by military and first responders for stress management. Improves sleep quality when practiced before bed.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort. If breath retention causes discomfort, practice without holds. Never strain or force the breath. Those with respiratory issues should practice without retention or under supervision."
  },
  {
    "id": "yoga_104",
    "title": "Chandra Bhedana - Left Nostril Breathing (Moon Piercing)",
    "source": "Hatha Yoga Pradipika",
    "category": "pranayama",
    "difficulty": "intermediate",
    "duration": "5-10 minutes",
    "info": "Chandra Bhedana is a cooling breath that activates the lunar (Ida) energy channel. Sit in a comfortable meditative posture. Use right hand in Nasagra Mudra. Close right nostril with thumb. Inhale slowly and deeply through left nostril only. At the top of inhalation, close left nostril with ring finger. Exhale through right nostril. This completes one round. Continue for 5-10 minutes. Always inhale through left, exhale through right. The left nostril is associated with cooling, calming energy.",
    "benefits": "Cools the body and mind. Reduces excess heat and inflammation. Calms nervous system and reduces stress. Lowers blood pressure. Reduces anger and aggression. Promotes sleep and relaxation. Balances excess Pitta dosha. Useful in hot weather or after heating practices. Soothes headaches and reduces mental agitation.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort. Avoid in very cold weather or if you have a cold. Those with low blood pressure should practice cautiously. Not recommended for those with depression as it may increase lethargy."
  },
  {
    "id": "yoga_105",
    "title": "Surya Bhedana - Right Nostril Breathing (Sun Piercing)",
    "source": "Hatha Yoga Pradipika",
    "category": "pranayama",
    "difficulty": "intermediate",
    "duration": "5-10 minutes",
    "info": "Surya Bhedana is a heating breath that activates the solar (Pingala) energy channel. Sit comfortably with spine erect. Use right hand in Nasagra Mudra. Close left nostril with ring finger. Inhale slowly and deeply through right nostril only. At the top of inhalation, close right nostril with thumb. Exhale through left nostril. This completes one round. Continue for 5-10 minutes. Always inhale through right, exhale through left. The right nostril is associated with heating, activating energy.",
    "benefits": "Energizes body and mind. Increases digestive fire (Agni). Generates internal heat. Activates sympathetic nervous system appropriately. Useful in cold weather. Helps overcome lethargy and depression. Balances excess Kapha dosha. Improves concentration and alertness. Prepares body for physical activity.",
    "precautions": "Contraindications: High blood pressure, heart disease, anxiety disorders, fever, excess heat in body. Avoid in hot weather or if feeling overheated. Not suitable for those with Pitta imbalance. Practice in morning or cool part of day. Stop if feeling agitated or overheated."
  },
  {
    "id": "yoga_106",
    "title": "Dirga Pranayama - Three-Part Breath (Complete Yogic Breath)",
    "source": "Foundational Pranayama",
    "category": "pranayama",
    "difficulty": "beginner",
    "duration": "5-10 minutes",
    "info": "Dirga Pranayama teaches complete utilization of lung capacity in three parts. Lie down or sit comfortably. Place one hand on belly, one on chest. Part 1 - Abdominal Breathing: Inhale deeply into belly, allowing it to expand. Exhale, drawing belly toward spine. Part 2 - Thoracic Breathing: Inhale into belly, then expand ribs and chest. Exhale from chest, then belly. Part 3 - Clavicular Breathing: Inhale into belly, ribs, then upper chest and collarbones. Exhale from top to bottom. Practice smooth, continuous breath filling all three areas. This is the foundation of all pranayama.",
    "benefits": "Maximizes oxygen intake and lung capacity. Reduces stress and anxiety immediately. Improves respiratory function. Massages internal organs through diaphragm movement. Calms nervous system. Excellent for beginners. Prepares for advanced pranayama. Helps manage asthma and breathing difficulties. Improves body awareness.",
    "precautions": "Practice under guidance if you are a beginner. Stop if you experience pain or discomfort. This is very safe for almost everyone. If feeling dizzy, breathe normally and rest. Never force the breath."
  },
  {
    "id": "yoga_107",
    "title": "Utkatasana - Chair Pose (Fierce Pose)",
    "source": "Common Yoga Protocol",
    "category": "standing_asana",
    "difficulty": "beginner",
    "duration": "30-60 seconds",
    "info": "Utkatasana builds strength and stamina. Stand in Tadasana with feet hip-width apart. Inhale and raise arms overhead, palms facing each other or joined. Exhale and bend knees as if sitting in an invisible chair. Lower hips until thighs are as close to parallel with floor as possible. Keep weight in heels, knees aligned over ankles (not beyond toes). Engage core and lengthen spine. Gaze forward or slightly up. Hold for 30-60 seconds while breathing steadily. To release, inhale and straighten legs, exhale and lower arms.",
    "benefits": "Strengthens thighs, calves, ankles, and spine. Tones shoulders and chest. Stimulates heart and diaphragm. Strengthens core muscles. Improves balance and stability. Builds stamina and willpower. Stretches Achilles tendons. Reduces flat feet. Therapeutic for building overall strength.",
    "precautions": "Contraindications: Chronic knee injury, arthritis in knees, headache, low blood pressure. Those with knee problems should not lower as deeply. Keep knees aligned - don't let them collapse inward. If lower back strains, engage core more and don't sit as low."
  },
  {
    "id": "yoga_108",
    "title": "Garudasana - Eagle Pose",
    "source": "Traditional Hatha Yoga",
    "category": "standing_asana",
    "difficulty": "intermediate",
    "duration": "30-60 seconds each side",
    "info": "Garudasana is named after Garuda, the eagle vehicle of Lord Vishnu. Stand in Tadasana. Bend knees slightly. Lift right foot and cross right thigh over left thigh. Hook right foot behind left calf if possible, or rest toes on floor. Extend arms forward, cross left arm over right at elbows. Bend elbows and wrap forearms, bringing palms together (or backs of hands together). Lift elbows to shoulder height, fingers pointing up. Sink deeper into the standing leg. Hold 30-60 seconds. Release and repeat on opposite side.",
    "benefits": "Strengthens ankles, calves, thighs, and hips. Opens shoulder joints and upper back. Improves balance and concentration. Stretches outer thighs, hips, shoulders, and upper back. Therapeutic for sciatica and rheumatism. Improves joint flexibility. Develops mental focus and stability.",
    "precautions": "Practice under guidance if you are a beginner. Contraindications: Knee injury, ankle injury, recent shoulder surgery. Those with knee problems should practice without the foot hook. If balance is challenging, practice near a wall."
  },
  {
    "id": "yoga_109",
    "title": "Natarajasana - Dancer's Pose (Lord of the Dance Pose)",
    "source": "Classical Yoga",
    "category": "standing_asana",
    "difficulty": "intermediate",
    "duration": "30-60 seconds each side",
    "info": "Natarajasana is dedicated to Shiva as Nataraja, the cosmic dancer. Stand in Tadasana. Shift weight to left foot. Bend right knee, bringing heel toward buttock. Reach back with right hand and grasp right ankle or foot. Extend left arm forward and up for balance. Begin to kick right foot into hand while hinging forward from hip. Lift right leg as high as comfortable while maintaining balance. Keep standing leg strong and slightly bent. Gaze at a fixed point ahead. Hold 30-60 seconds. Release carefully and repeat on opposite side.",
    "benefits": "Strengthens legs, ankles, and core. Opens chest and shoulders. Improves balance and concentration. Stretches thighs, groins, abdomen, chest, and shoulders. Develops grace and poise. Strengthens back muscles. Improves posture. Therapeutic for improving focus and mental clarity.",
    "precautions": "Contraindications: Low blood pressure, ankle or knee injury, severe back problems. Practice near a wall for support if needed. Those with balance issues should practice a gentler version. Avoid if you have severe vertigo."
  },
  {
    "id": "yoga_110",
    "title": "Parsvottanasana - Pyramid Pose (Intense Side Stretch)",
    "source": "Iyengar Yoga",
    "category": "standing_asana",
    "difficulty": "intermediate",
    "duration": "30-60 seconds each side",
    "info": "Parsvottanasana provides an intense stretch to the hamstrings and spine. Stand in Tadasana. Step right foot back about 3-4 feet. Turn right foot out 45-60 degrees. Square hips to face forward. Bring hands to prayer position behind back (or hold elbows). Inhale and lengthen spine. Exhale and fold forward from hips over front leg, keeping spine long. Bring torso as close to front thigh as possible. Keep both legs straight. Hold 30-60 seconds breathing steadily. Inhale to rise up. Repeat on opposite side.",
    "benefits": "Deeply stretches hamstrings, hips, and spine. Strengthens legs and improves balance. Opens shoulders and chest. Calms the brain and improves focus. Stimulates abdominal organs. Improves posture and body alignment. Therapeutic for flat feet and sciatica. Strengthens spine.",
    "precautions": "Contraindications: High blood pressure (don't fold deeply), back injury, hamstring injury. Keep knees straight but not locked. If hamstrings are tight, keep hands on blocks beside front foot instead of in prayer position. Avoid deep forward fold if you have severe back problems."
  },
  {
    "id": "yoga_111",
    "title": "Virabhadrasana III - Warrior III",
    "source": "Modern Vinyasa Yoga",
    "category": "standing_asana",
    "difficulty": "advanced",
    "duration": "30-60 seconds each side",
    "info": "Warrior III is a challenging balancing pose requiring strength and focus. Stand in Tadasana. Shift weight to right foot. Hinge forward from hips while simultaneously lifting left leg behind you. Extend arms forward or alongside body. Create one straight line from fingertips through torso to left foot - body parallel to floor. Keep hips level and square to floor. Engage standing leg and core strongly. Flex back foot. Gaze down at floor or forward. Hold 30-60 seconds. Return to standing and repeat on opposite side.",
    "benefits": "Strengthens entire back body - ankles, legs, shoulders, back. Tones abdomen. Improves balance and posture. Develops concentration and mental focus. Strengthens core muscles. Improves coordination. Therapeutic for improving body awareness and alignment.",
    "precautions": "Contraindications: High blood pressure, heart problems, recent abdominal surgery. Practice near a wall or use a chair for support when learning. Those with balance issues should practice with support. Keep neck in neutral - don't strain by looking forward if it causes tension."
  },
  {
    "id": "yoga_112",
    "title": "Malasana - Garland Pose (Yogic Squat)",
    "source": "Traditional Yoga",
    "category": "seated_asana",
    "difficulty": "beginner",
    "duration": "1-5 minutes",
    "info": "Malasana is a natural resting position in many cultures. Stand with feet slightly wider than hip-width, toes turned out. Bend knees and lower hips into a squat. Bring hands to prayer position at heart center. Use elbows to gently press knees open. Lengthen spine and lift chest. Keep heels on floor if possible; if not, place folded blanket under heels. Keep weight in heels. Hold for 1-5 minutes, breathing deeply. This is a resting pose that can be held for extended periods.",
    "benefits": "Opens hips, groins, and ankles deeply. Strengthens core and pelvic floor. Aids digestion and elimination. Stretches lower back. Tones abdominal muscles. Prepares body for childbirth. Improves balance and stability. Therapeutic for constipation and flat feet. Grounds and centers energy.",
    "precautions": "Contraindications: Knee injury, ankle injury, low back injury. If heels don't reach floor, use support under heels. Those with knee problems should practice cautiously and not go too deep. Pregnant women should keep knees wide apart. Avoid if you have severe knee or hip problems."
  },
  {
    "id": "yoga_113",
    "title": "Baddha Konasana - Butterfly Pose (Bound Angle Pose)",
    "source": "Common Yoga Protocol",
    "category": "seated_asana",
    "difficulty": "beginner",
    "duration": "1-5 minutes",
    "info": "Baddha Konasana is excellent for hip opening. Sit with spine erect, legs extended. Bend both knees and bring soles of feet together, drawing heels toward pelvis. Hold feet or ankles with hands. Let knees drop toward floor (don't force). Sit tall, lengthening spine. For deeper stretch, fold forward from hips while maintaining long spine. Can gently pulse knees up and down like butterfly wings for dynamic variation. Hold static position for 1-5 minutes, breathing deeply.",
    "benefits": "Opens hips and groin deeply. Stretches inner thighs and knees. Stimulates abdominal organs, ovaries, and prostate. Improves circulation in pelvis. Helps relieve menstrual discomfort and menopause symptoms. Therapeutic for flat feet, high blood pressure, infertility, and sciatica. Prepares body for childbirth. Reduces fatigue. Soothes digestive problems.",
    "precautions": "Contraindications: Groin or knee injury, sciatica. If knees are high off floor, place blocks or blankets under knees for support. Don't force knees down. Those with lower back issues should sit on a blanket or block. Avoid deep forward fold if pregnant (keep spine upright)."
  },
  {
    "id": "yoga_114",
    "title": "Gomukhasana - Cow Face Pose",
    "source": "Traditional Hatha Yoga",
    "category": "seated_asana",
    "difficulty": "intermediate",
    "duration": "1-3 minutes each side",
    "info": "Gomukhasana resembles a cow's face when viewed from front. Sit with legs extended. Bend left knee and place left foot beside right hip. Cross right leg over left, stacking right knee over left knee, right foot beside left hip. Sit evenly on both sitting bones. Extend right arm up, bend elbow bringing right hand down back. Reach left arm to side, bend elbow bringing left hand up back. Clasp hands behind back if possible; if not, use a strap. Sit tall, lifting chest. Hold 1-3 minutes. Release and repeat on opposite side.",
    "benefits": "Opens hips and shoulders deeply. Stretches ankles, thighs, shoulders, armpits, chest, and triceps. Improves posture. Therapeutic for sciatica, frozen shoulder, and chronic knee pain. Stretches hip rotators. Opens chest and improves breathing. Strengthens spine.",
    "precautions": "Contraindications: Serious neck, shoulder, knee, or hip injury. If hands don't meet, use a strap between them. If hips are tight, sit on a block or blanket. Those with knee problems should practice leg position carefully or modify. If shoulders are very tight, work on arm position separately."
  },
  {
    "id": "yoga_115",
    "title": "Janu Sirsasana - Head-to-Knee Forward Bend",
    "source": "Iyengar Yoga",
    "category": "seated_asana",
    "difficulty": "beginner",
    "duration": "1-3 minutes each side",
    "info": "Janu Sirsasana is a calming forward bend. Sit with legs extended. Bend right knee and place sole of right foot against inner left thigh. Right knee drops to side. Square torso to face over extended left leg. Inhale and lengthen spine, raising arms. Exhale and fold forward from hips over left leg, keeping spine long. Hold left foot, ankle, or use strap around foot. With each inhale lengthen, with each exhale fold deeper. Eventually head may rest on shin. Hold 1-3 minutes. Repeat on opposite side.",
    "benefits": "Stretches spine, shoulders, hamstrings, and groin. Calms brain and relieves mild depression. Stimulates liver and kidneys. Improves digestion. Relieves anxiety, fatigue, headache, and menstrual discomfort. Therapeutic for high blood pressure, insomnia, and sinusitis. Soothes menopause symptoms.",
    "precautions": "Contraindications: Asthma, diarrhea, knee injury. Those with lower back problems should keep spine straight and use props. Don't round spine - fold from hips. If hamstrings are tight, use a strap and keep knee slightly bent. Pregnant women should keep legs wider apart."
  },
  {
    "id": "yoga_116",
    "title": "Upavishta Konasana - Wide-Angle Seated Forward Bend",
    "source": "Iyengar Yoga",
    "category": "seated_asana",
    "difficulty": "intermediate",
    "duration": "1-3 minutes",
    "info": "Upavishta Konasana provides an intense inner thigh and hamstring stretch. Sit with legs extended in a wide V-shape, as wide as comfortable. Flex feet, toes pointing up. Place hands on floor in front of torso. Inhale and lengthen spine. Exhale and walk hands forward, folding from hips. Keep spine long as long as possible. Eventually torso may rest on floor between legs. Can also fold over right leg, then center, then left leg. Hold 1-3 minutes, breathing deeply.",
    "benefits": "Stretches insides and backs of legs deeply. Opens hips and groin. Stimulates abdominal organs. Strengthens spine. Calms the brain. Releases tension in lower back. Therapeutic for arthritis, sciatica, and infertility. Improves flexibility for other poses.",
    "precautions": "Contraindications: Lower back injury, hamstring injury. Sit on a blanket if hips are tight. Don't force the forward fold - let gravity do the work. Keep knees and toes pointing straight up. Those with very tight hamstrings should keep legs closer together. Avoid if you have severe sciatica."
  },
  {
    "id": "yoga_117",
    "title": "Dhanurasana - Bow Pose",
    "source": "Traditional Hatha Yoga",
    "category": "backbend",
    "difficulty": "intermediate",
    "duration": "20-30 seconds",
    "info": "Dhanurasana resembles an archer's bow. Lie on stomach with feet hip-width apart, arms alongside body. Bend knees bringing heels toward buttocks. Reach back and grasp ankles (outside or inside). Inhale and simultaneously lift chest and kick feet into hands, raising thighs off floor. Lift chest and head. Draw shoulders away from ears. Gaze forward or slightly up. The body curves like a bow. Hold 20-30 seconds, breathing as normally as possible. Exhale and release. Rest in child's pose.",
    "benefits": "Stretches entire front body - thighs, abdomen, chest, throat. Strengthens back muscles. Stimulates abdominal organs and improves digestion. Opens chest and improves breathing. Improves posture. Therapeutic for menstrual discomfort, constipation, and respiratory ailments. Stimulates reproductive organs. Reduces stress and fatigue.",
    "precautions": "Contraindications: High or low blood pressure, migraine, hernia, neck injury, low back injury, recent abdominal surgery, pregnancy. Don't practice if you have serious back problems. Keep neck in neutral - don't strain it. If difficult to grasp ankles, use a strap around ankles."
  },
  {
    "id": "yoga_118",
    "title": "Matsyasana - Fish Pose",
    "source": "Classical Hatha Yoga",
    "category": "backbend",
    "difficulty": "beginner",
    "duration": "30-60 seconds",
    "info": "Matsyasana is the 'fish pose' said to help one float like a fish. Lie on back with legs extended or in Padmasana (lotus). Place hands palms-down under buttocks. Press forearms and elbows firmly into floor. Inhale and lift chest, arching back and tilting head back. Top of head may rest lightly on floor, but weight should be in elbows, not head. Expand chest fully. Hold 30-60 seconds, breathing deeply. To release, press elbows down, lift head, and slowly lower back to floor.",
    "benefits": "Stretches deep hip flexors, intercostals, and abdominal muscles. Opens chest and throat. Stretches and stimulates throat and belly organs. Strengthens upper back and back of neck. Therapeutic for respiratory problems, anxiety, and fatigue. Improves posture. Stimulates thyroid and parathyroid glands. Relieves tension in neck and shoulders.",
    "precautions": "Contraindications: High or low blood pressure, migraine, serious neck or lower back injury. Don't place too much weight on head - use elbows for support. Those with neck problems should place a folded blanket under head. Avoid if you have serious spinal problems."
  },
  {
    "id": "yoga_119",
    "title": "Urdhva Dhanurasana - Wheel Pose (Upward Bow)",
    "source": "Advanced Hatha Yoga",
    "category": "backbend",
    "difficulty": "advanced",
    "duration": "30-60 seconds",
    "info": "Urdhva Dhanurasana is a deep backbend requiring strength and flexibility. Lie on back, bend knees, place feet hip-width apart near buttocks. Place palms on floor beside ears, fingers pointing toward shoulders. Press firmly into hands and feet. Inhale and lift hips and chest, straightening arms and legs as much as comfortable. Form a high arch with body. Press into all four corners of feet. Engage legs strongly. Relax head and neck. Hold 30-60 seconds. To release, tuck chin and slowly lower down.",
    "benefits": "Strengthens arms, wrists, legs, buttocks, abdomen, and spine. Stretches chest, lungs, shoulders, hip flexors, and abdomen. Stimulates thyroid and pituitary glands. Energizes entire body. Therapeutic for asthma, back pain, infertility, and osteoporosis. Builds confidence and courage. Improves mood.",
    "precautions": "Contraindications: Back injury, carpal tunnel syndrome, diarrhea, headache, heart problems, high or low blood pressure, pregnancy. This is an advanced pose - build up with bridge pose and other backbends first. Keep feet parallel and knees aligned. Don't practice without proper warm-up. Seek expert guidance when learning."
  },
  {
    "id": "yoga_120",
    "title": "Sirsasana - Headstand (King of Asanas)",
    "source": "Classical Hatha Yoga",
    "category": "inversion",
    "difficulty": "advanced",
    "duration": "1-5 minutes",
    "info": "Sirsasana is called the 'king of asanas' for its benefits. Start on hands and knees. Interlace fingers, place forearms on floor with elbows shoulder-width apart. Place crown of head on floor, back of head cradled by hands. Straighten legs, walk feet toward head. When hips are over shoulders, slowly lift feet off floor, bending knees initially. Straighten legs upward once balanced. Body should be in one straight line. Engage core and legs. Hold 1-5 minutes. To come down, bend knees and slowly lower with control. Rest in child's pose.",
    "benefits": "Increases blood flow to brain. Improves concentration, memory, and mental clarity. Strengthens core, arms, and shoulders. Improves balance and body awareness. Stimulates pituitary and pineal glands. Therapeutic for asthma, infertility, insomnia, and sinusitis. Relieves stress and mild depression. Builds confidence.",
    "precautions": "Contraindications: Back injury, headache, heart condition, high blood pressure, menstruation, neck injury, pregnancy, glaucoma, detached retina. MUST learn under expert supervision. Practice against wall initially. Don't kick up - use control. Stop if you feel pressure in head or eyes. This is an advanced pose requiring significant preparation."
  },
  {
    "id": "yoga_121",
    "title": "Sarvangasana - Shoulder Stand (Queen of Asanas)",
    "source": "Classical Hatha Yoga",
    "category": "inversion",
    "difficulty": "intermediate",
    "duration": "1-5 minutes",
    "info": "Sarvangasana means 'all-limbs pose' and is called the 'queen of asanas.' Use folded blankets under shoulders for neck protection. Lie on back. Bend knees, press arms down, and lift legs overhead. Support back with hands, elbows close together. Extend legs straight up toward ceiling. Body should form a straight line from shoulders to toes. Chin naturally presses into chest (Jalandhara Bandha). Weight is on shoulders and upper arms, never on neck. Hold 1-5 minutes. To release, bend knees, slowly roll down vertebra by vertebra.",
    "benefits": "Improves circulation throughout body. Stimulates thyroid and parathyroid glands. Regulates metabolism. Calms nervous system. Reduces stress and fatigue. Therapeutic for asthma, infertility, and sinusitis. Relieves menopause symptoms. Improves digestion. Strengthens shoulders and core. Helps with varicose veins.",
    "precautions": "Contraindications: Diarrhea, headache, high blood pressure, menstruation, neck injury, pregnancy (if not practiced before pregnancy), glaucoma, detached retina. ALWAYS use blankets to protect neck. Never turn head while in pose. Those with neck problems should avoid or practice with expert guidance. Don't practice if you have serious spinal problems."
  },
  {
    "id": "yoga_122",
    "title": "Halasana - Plow Pose",
    "source": "Traditional Yoga",
    "category": "inversion",
    "difficulty": "intermediate",
    "duration": "1-3 minutes",
    "info": "Halasana is often practiced after shoulder stand. From shoulder stand or lying on back, support lower back with hands. Slowly lower legs over head until toes touch floor behind head. Keep legs straight. Arms can extend on floor opposite to legs, palms down, or remain supporting back. Legs and torso should form a 90-degree angle if possible. Breathe normally. Hold 1-3 minutes. To release, support back with hands and slowly roll down.",
    "benefits": "Calms the brain and nervous system. Reduces stress and fatigue. Stimulates abdominal organs and thyroid. Stretches shoulders and spine. Therapeutic for backache, headache, infertility, insomnia, and sinusitis. Helps relieve menopause symptoms. Relieves digestive problems.",
    "precautions": "Contraindications: Diarrhea, menstruation, neck injury, asthma, high blood pressure, pregnancy. Use blankets under shoulders to protect neck. Don't force toes to floor - use a chair or blocks for support if needed. Never turn head while in pose. Those with stiff backs should practice with feet on a chair behind head."
  },
  {
    "id": "yoga_123",
    "title": "Bakasana - Crow Pose (Crane Pose)",
    "source": "Arm Balance Yoga",
    "category": "arm_balance",
    "difficulty": "intermediate",
    "duration": "20-60 seconds",
    "info": "Bakasana is a foundational arm balance building strength and confidence. Squat with feet together. Place hands on floor shoulder-width apart, fingers spread wide. Bend elbows slightly, creating a shelf. Place knees high on backs of upper arms (on triceps). Shift weight forward onto hands. Look forward, not down. Slowly lift one foot, then the other off floor. Bring feet together. Straighten arms as strength develops. Hold 20-60 seconds. To release, slowly lower feet to floor.",
    "benefits": "Strengthens arms, wrists, and core. Tones abdominal organs. Opens groins. Improves balance and concentration. Builds confidence. Prepares for more advanced arm balances. Strengthens hip flexors. Develops body awareness and control.",
    "precautions": "Contraindications: Carpal tunnel syndrome, wrist injury, shoulder injury, pregnancy. Place a pillow or blanket in front of you when learning in case you fall forward. Keep elbows close together. Don't practice if you have serious wrist problems. Build wrist strength gradually."
  },
  {
    "id": "yoga_124",
    "title": "Chaturanga Dandasana - Four-Limbed Staff Pose",
    "source": "Vinyasa Yoga",
    "category": "arm_balance",
    "difficulty": "intermediate",
    "duration": "10-30 seconds",
    "info": "Chaturanga is a key transition pose in Vinyasa yoga, like a yoga push-up. From plank position with hands shoulder-width apart, shift weight slightly forward onto toes. Exhale and lower body in one straight line until upper arms are parallel to floor, elbows at 90 degrees. Elbows stay close to ribs, pointing back. Core engaged strongly. Body hovers a few inches above floor. Shoulders stay level with elbows. Hold 10-30 seconds or use as transition. To release, lower to floor or press back to plank.",
    "benefits": "Strengthens arms, wrists, shoulders, and core. Tones abdomen. Builds upper body and core strength. Improves posture. Prepares body for more advanced arm balances. Develops mental focus and determination. Strengthens muscles around spine.",
    "precautions": "Contraindications: Carpal tunnel syndrome, wrist or shoulder injury, pregnancy (later stages). Keep elbows at 90 degrees - don't let them splay out or shoulders drop below elbows. Modify by lowering knees to floor. Build strength gradually. Common mistakes: sagging hips, shoulders dropping too low, elbows wide."
  },
  {
    "id": "yoga_125",
    "title": "Vasisthasana - Side Plank Pose",
    "source": "Traditional Yoga",
    "category": "arm_balance",
    "difficulty": "intermediate",
    "duration": "30-60 seconds each side",
    "info": "Vasisthasana is named after sage Vasistha. From plank, shift weight to right hand and outer edge of right foot. Stack left foot on right. Rotate torso to left, extending left arm straight up toward ceiling. Left arm, torso, and right arm form one straight line. Stack hips and shoulders. Gaze at left hand or forward. Engage entire body. Hold 30-60 seconds. Return to plank and repeat on opposite side. Modifications: lower knee of bottom leg to floor, or place top foot in front of bottom foot.",
    "benefits": "Strengthens arms, wrists, legs, and core. Improves balance and concentration. Tones entire body. Strengthens obliques. Opens chest. Improves focus and determination. Builds stamina. Therapeutic for strengthening wrists.",
    "precautions": "Contraindications: Serious wrist, elbow, or shoulder injury. Those with wrist problems should practice forearm variation. Keep supporting hand directly under shoulder. Engage core to avoid sagging hips. Modify as needed."
  },
  {
    "id": "yoga_126",
    "title": "Chandra Namaskar - Moon Salutation",
    "source": "Traditional Yoga Sequence",
    "category": "sequence",
    "difficulty": "beginner",
    "duration": "5-10 minutes",
    "info": "Chandra Namaskar is a cooling, calming sequence honoring the moon. The sequence: 1) Prayer Pose (standing), 2) Arms overhead with side bend right, 3) Return center, side bend left, 4) Forward Fold, 5) Low Lunge right leg back, 6) Low Squat, 7) Low Lunge left leg back, 8) Forward Fold, 9) Arms overhead with side bend right, 10) Center, side bend left, 11) Prayer Pose. Flow smoothly between poses, coordinating breath. Emphasize lateral movements and hip openers. Practice in evening or when you need calming energy.",
    "benefits": "Calms nervous system and mind. Cools the body. Relieves stress and anxiety. Opens hips and side body. Improves flexibility. Balances energy. Prepares for sleep. Complements active Yang practices. Therapeutic for insomnia and hyperactivity.",
    "precautions": "Practice under guidance if you are a beginner. Move slowly and mindfully. Respect your body's limits. This is generally safe for all levels. Those with knee problems should modify the low squat."
  },
  {
    "id": "yoga_127",
    "title": "Morning Energizing Sequence - 15 Minutes",
    "source": "Modern Yoga Practice",
    "category": "sequence",
    "difficulty": "beginner",
    "duration": "15 minutes",
    "info": "A quick morning practice to energize. 1) Child's Pose - 1 min, 2) Cat-Cow - 1 min, 3) Downward Dog - 1 min, 4) Sun Salutations - 3 rounds (6 min), 5) Warrior I & II - 1 min each side (2 min), 6) Tree Pose - 30 sec each side (1 min), 7) Seated Forward Bend - 1 min, 8) Seated Twist both sides - 1 min total, 9) Savasana - 1 min. Focus on linking breath with movement. Move dynamically to build heat and energy.",
    "benefits": "Energizes body and mind for the day. Improves circulation. Wakes up all body systems. Builds strength and flexibility. Improves focus. Sets positive intention for day. Takes minimal time but provides maximum benefit.",
    "precautions": "Practice under guidance if you are a beginner. Listen to your body - don't force. Modify poses as needed. Skip or modify if you have any injuries."
  },
  {
    "id": "yoga_128",
    "title": "Evening Wind-Down Sequence - 20 Minutes",
    "source": "Restorative Yoga",
    "category": "sequence",
    "difficulty": "beginner",
    "duration": "20 minutes",
    "info": "Calming sequence for evening relaxation. 1) Easy Pose with gentle neck rolls - 2 min, 2) Cat-Cow - 2 min slow, 3) Child's Pose - 2 min, 4) Gentle Seated Forward Bend - 3 min, 5) Supine Twist both sides - 2 min each (4 min), 6) Happy Baby - 2 min, 7) Legs-up-the-Wall - 3 min, 8) Savasana - 5 min. Practice slowly and gently. Focus on releasing tension. Use props for comfort.",
    "benefits": "Calms nervous system. Prepares for restful sleep. Releases physical and mental tension. Reduces stress and anxiety. Improves sleep quality. Activates parasympathetic nervous system. Soothes digestive system.",
    "precautions": "Practice under guidance if you are a beginner. This is very gentle and safe. Avoid if you have serious injuries. Use props liberally for maximum comfort and relaxation."
  },
  {
    "id": "yoga_129",
    "title": "Desk Yoga Sequence - 10 Minutes",
    "source": "Office Yoga",
    "category": "sequence",
    "difficulty": "beginner",
    "duration": "10 minutes",
    "info": "Sequence to counteract sitting at desk. Can be done in office clothes, no mat needed. 1) Seated neck rolls - 1 min, 2) Shoulder rolls and shrugs - 1 min, 3) Seated spinal twist both sides - 1 min each, 4) Seated cat-cow (hands on knees) - 1 min, 5) Wrist circles and stretches - 1 min, 6) Standing forward fold - 1 min, 7) Standing side bend each side - 30 sec each, 8) Chair pose - 30 sec, 9) Tree pose - 30 sec each side, 10) Seated meditation/breathing - 1 min.",
    "benefits": "Relieves tension from sitting. Counteracts poor posture. Reduces back and neck pain. Improves circulation. Boosts energy and focus. Reduces eye strain. Releases hip flexors. Improves mood and productivity.",
    "precautions": "Practice under guidance if you are a beginner. Very safe for office environment. Move gently. Don't force. Breathe naturally."
  },
  {
    "id": "yoga_130",
    "title": "Flexibility Flow - 30 Minutes",
    "source": "Yin/Hatha Yoga",
    "category": "sequence",
    "difficulty": "intermediate",
    "duration": "30 minutes",
    "info": "Sequence focused on increasing flexibility. Hold poses longer (2-3 minutes each). 1) Butterfly Pose - 3 min, 2) Wide-Angle Seated Forward Fold - 3 min, 3) Pigeon Pose - 3 min each side (6 min total), 4) Seated Forward Bend - 3 min, 5) Reclined Hand-to-Big-Toe (both variations) - 2 min each side (8 min total), 6) Supine Twist - 2 min each side (4 min), 7) Savasana - 3 min. Use props. Breathe into stretches. Release with each exhale.",
    "benefits": "Significantly improves flexibility. Releases deep tension in connective tissue. Calms nervous system. Improves range of motion. Therapeutic for tight hips and hamstrings. Prepares body for deeper poses. Meditative and introspective.",
    "precautions": "Practice under guidance if you are a beginner. Never force stretches. Use props liberally. Those with very tight muscles should hold for shorter duration initially. Avoid if you have joint hypermobility. Be patient - flexibility develops gradually."
  },
  {
    "id": "yoga_131",
    "title": "Strength Building Flow - 40 Minutes",
    "source": "Power Yoga",
    "category": "sequence",
    "difficulty": "intermediate",
    "duration": "40 minutes",
    "info": "Sequence to build strength and stamina. 1) Warm-up: Sun Salutations - 5 rounds (10 min), 2) Warrior sequence: Warrior I, II, III, Side Angle - 2 min each pose, both sides (16 min total), 3) Core work: Plank, Dolphin Plank, Side Plank variations - 1 min each (3 min), 4) Chair Pose - 1 min, 5) Crow Pose practice - 2 min, 6) Boat Pose - 1 min, 7) Locust Pose - 1 min, 8) Bow Pose - 1 min, 9) Cool-down: Child's Pose, Seated Forward Bend - 2 min each, 10) Savasana - 3 min.",
    "benefits": "Builds full-body strength. Increases stamina and endurance. Tones muscles. Burns calories. Improves cardiovascular health. Builds bone density. Boosts metabolism. Increases mental toughness and focus.",
    "precautions": "Contraindications: Heart conditions, uncontrolled high blood pressure, recent surgery. Warm up properly. Stay hydrated. Don't hold breath - breathe steadily. Modify as needed. Those new to yoga should start with gentler practice."
  },
  {
    "id": "yoga_132",
    "title": "Muladhara Chakra - Root Chakra",
    "source": "Chakra System",
    "category": "chakra",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Muladhara is the first chakra, located at the base of the spine/perineum. Element: Earth. Color: Red. Seed mantra: LAM. Represents: Survival, grounding, stability, security, basic needs. Physical associations: Legs, feet, bones, large intestine, adrenal glands. When balanced: Feeling grounded, safe, secure, stable. Strong foundation. Good physical health. Financial security. When imbalanced: Fear, anxiety, insecurity. Financial problems. Eating disorders. Low back pain. Constipation. To balance: Grounding poses (Mountain, Warrior, Tree), walking barefoot, connecting with nature, red foods, affirmations like 'I am safe and grounded.'",
    "benefits": "Understanding root chakra helps address issues of security and grounding. Balancing practices create stability in life. Supports healthy relationship with physical body and material world.",
    "precautions": "Chakra work is complementary to, not replacement for, medical or psychological care. Approach with open mind but also discernment."
  },
  {
    "id": "yoga_133",
    "title": "Svadhisthana Chakra - Sacral Chakra",
    "source": "Chakra System",
    "category": "chakra",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Svadhisthana is the second chakra, located in lower abdomen/sacrum area. Element: Water. Color: Orange. Seed mantra: VAM. Represents: Creativity, sexuality, emotions, pleasure, relationships. Physical associations: Reproductive organs, kidneys, bladder, hip area. When balanced: Comfortable with sexuality. Creative expression flows. Healthy emotions. Passionate about life. When imbalanced: Emotional instability. Sexual dysfunction. Creative blocks. Guilt. Addiction. To balance: Hip openers (Pigeon, Butterfly, Goddess Pose), creative activities, water activities, orange foods, sacral breathing, affirmations like 'I embrace pleasure and abundance.'",
    "benefits": "Balancing sacral chakra enhances creativity and emotional intelligence. Supports healthy relationships and sensuality. Promotes joy and passion for life.",
    "precautions": "Chakra work is complementary to, not replacement for, medical or psychological care. Emotional releases may occur during practice."
  },
  {
    "id": "yoga_134",
    "title": "Manipura Chakra - Solar Plexus Chakra",
    "source": "Chakra System",
    "category": "chakra",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Manipura is the third chakra, located at solar plexus/navel area. Element: Fire. Color: Yellow. Seed mantra: RAM. Represents: Personal power, will, confidence, self-esteem, transformation. Physical associations: Digestive system, liver, pancreas, stomach, small intestine. When balanced: Strong self-esteem. Confident. Good boundaries. Strong digestion. Able to manifest goals. When imbalanced: Low self-esteem. Lack of will. Digestive issues. Control issues. Anger. Powerlessness. To balance: Core strengthening poses (Boat, Plank, Warrior III), Kapalabhati pranayama, sun exposure, yellow foods, fire gazing, affirmations like 'I am powerful and confident.'",
    "benefits": "Balancing solar plexus chakra builds confidence and personal power. Improves digestion. Supports ability to take action and manifest goals.",
    "precautions": "Chakra work is complementary to, not replacement for, medical or psychological care. Those with digestive issues should also seek medical advice."
  },
  {
    "id": "yoga_135",
    "title": "Anahata Chakra - Heart Chakra",
    "source": "Chakra System",
    "category": "chakra",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Anahata is the fourth chakra, located at the heart center. Element: Air. Color: Green or pink. Seed mantra: YAM. Represents: Love, compassion, forgiveness, relationships, connection. Physical associations: Heart, lungs, circulatory system, arms, hands, thymus gland. When balanced: Loving. Compassionate. Forgiving. Healthy relationships. Self-love. When imbalanced: Difficulty with relationships. Closed-hearted. Jealousy. Loneliness. Heart or lung problems. To balance: Heart openers (Cobra, Camel, Bridge, Wheel), pranayama, loving-kindness meditation, green foods, spending time in nature, affirmations like 'I give and receive love freely.'",
    "benefits": "Balancing heart chakra opens capacity for love and compassion. Heals relationship wounds. Improves respiratory and cardiovascular health.",
    "precautions": "Chakra work is complementary to, not replacement for, medical or psychological care. Heart opening can bring up buried emotions."
  },
  {
    "id": "yoga_136",
    "title": "Vishuddha Chakra - Throat Chakra",
    "source": "Chakra System",
    "category": "chakra",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Vishuddha is the fifth chakra, located at the throat. Element: Ether/Space. Color: Blue. Seed mantra: HAM. Represents: Communication, self-expression, truth, authenticity. Physical associations: Throat, thyroid, parathyroid, neck, jaw, mouth, teeth. When balanced: Clear communication. Speaks truth. Good listener. Authentic expression. When imbalanced: Difficulty expressing oneself. Lying. Gossip. Fear of speaking. Thyroid problems. Sore throat. To balance: Shoulder stand, plow pose, fish pose, Ujjayi breathing, chanting, singing, blue foods, journaling, affirmations like 'I speak my truth clearly.'",
    "benefits": "Balancing throat chakra improves communication skills. Supports authentic self-expression. May help thyroid function.",
    "precautions": "Chakra work is complementary to, not replacement for, medical or psychological care. Those with thyroid issues should work with healthcare provider."
  },
  {
    "id": "yoga_137",
    "title": "Ajna Chakra - Third Eye Chakra",
    "source": "Chakra System",
    "category": "chakra",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Ajna is the sixth chakra, located between eyebrows. Element: Light. Color: Indigo/purple. Seed mantra: OM. Represents: Intuition, wisdom, imagination, clarity, insight. Physical associations: Brain, eyes, pituitary gland, pineal gland. When balanced: Clear intuition. Good imagination. Wisdom. Clear thinking. When imbalanced: Lack of clarity. Confusion. Delusion. Headaches. Eye problems. Nightmares. To balance: Child's pose, forward folds, meditation, visualization, dream work, purple foods, limiting screen time, affirmations like 'I trust my intuition.'",
    "benefits": "Balancing third eye chakra enhances intuition and mental clarity. Improves imagination and insight. Supports spiritual development.",
    "precautions": "Chakra work is complementary to, not replacement for, medical or psychological care. Intense third eye work should be done gradually."
  },
  {
    "id": "yoga_138",
    "title": "Sahasrara Chakra - Crown Chakra",
    "source": "Chakra System",
    "category": "chakra",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Sahasrara is the seventh chakra, located at crown of head. Element: Thought/Consciousness. Color: Violet or white. Seed mantra: AUM or silence. Represents: Spiritual connection, enlightenment, unity, pure consciousness. Physical associations: Cerebral cortex, pineal gland, central nervous system. When balanced: Spiritual connection. Sense of peace. Wisdom. Unity consciousness. When imbalanced: Disconnection from spirituality. Closed-mindedness. Cynicism. Learning difficulties. To balance: Headstand, meditation, pranayama, prayer, fasting, silence, study of spiritual texts, affirmations like 'I am connected to divine consciousness.'",
    "benefits": "Balancing crown chakra facilitates spiritual awakening. Creates sense of unity and peace. Supports highest states of consciousness.",
    "precautions": "Chakra work is complementary to, not replacement for, medical or psychological care. Crown chakra work should be grounded in lower chakra stability."
  },
  {
    "id": "yoga_139",
    "title": "Yoga for Weight Management",
    "source": "Therapeutic Yoga",
    "category": "therapeutic",
    "difficulty": "beginner",
    "duration": "varies",
    "info": "Yoga supports healthy weight through multiple pathways. Recommended practices: Active vinyasa flows build cardiovascular fitness. Strength-building poses increase muscle mass and metabolism. Core work (Boat, Plank variations) tones abdominal area. Power yoga and Ashtanga styles burn calories. Pranayama increases oxygen delivery and metabolic efficiency. Meditation reduces stress eating and emotional eating. Mindfulness practices improve relationship with food. Consistent practice regulates hormones affecting weight. Key principles: Practice 5-6 days per week mixing active and restorative styles. Combine with healthy diet and adequate sleep. Address underlying stress and emotional issues. Set realistic goals focused on health, not just appearance.",
    "benefits": "Supports healthy, sustainable weight loss. Builds lean muscle mass. Increases metabolism. Reduces stress-related eating. Improves body image and self-acceptance. Creates mindful eating habits. Addresses root causes of weight issues.",
    "precautions": "Consult healthcare provider before beginning if significantly overweight or have health conditions. Start gently and build gradually. Avoid extreme practices. Focus on overall health, not just weight. Those with eating disorders should work with mental health professional."
  },
  {
    "id": "yoga_140",
    "title": "Yoga for Diabetes Management",
    "source": "Medical Yoga Therapy",
    "category": "therapeutic",
    "difficulty": "beginner",
    "duration": "varies",
    "info": "Yoga helps manage diabetes through stress reduction and improved insulin sensitivity. Beneficial practices: Gentle asanas improve glucose metabolism. Twisting poses massage pancreas. Pawanmuktasana series aids digestion. Surya Namaskar provides mild cardio exercise. Pranayama reduces stress hormones affecting blood sugar. Meditation improves stress management crucial for diabetes control. Vajrasana after meals aids digestion. Avoid: Intense inversions, breath retention (Kumbhaka), strenuous poses if blood sugar is uncontrolled. Practice guidelines: Check blood sugar before and after practice. Practice at consistent times. Have quick-acting sugar available. Inform instructor about condition. Regular practice shows significant improvement in HbA1c levels in research studies.",
    "benefits": "Improves insulin sensitivity and glucose metabolism. Reduces stress affecting blood sugar. Aids weight management. Improves cardiovascular health. Reduces diabetes complications. Supports medication effectiveness. Improves quality of life.",
    "precautions": "Contraindications: Uncontrolled blood sugar, diabetic retinopathy (avoid inversions), severe neuropathy. Always consult endocrinologist before starting. Monitor blood sugar regularly. Adjust medication as needed with doctor. Watch for hypoglycemia during practice. Keep practice moderate and consistent."
  },
  {
    "id": "yoga_141",
    "title": "Yoga for PCOS (Polycystic Ovary Syndrome)",
    "source": "Women's Health Yoga",
    "category": "therapeutic",
    "difficulty": "beginner",
    "duration": "varies",
    "info": "Yoga helps manage PCOS through hormonal balance and stress reduction. Beneficial poses: Butterfly Pose opens hips and stimulates ovaries. Bharadvajasana stimulates abdominal organs. Bhujangasana stimulates ovaries and adrenal glands. Padmasana or Sukhasana for meditation. Supported Bridge opens pelvis. Legs-up-Wall improves circulation to reproductive organs. Pranayama: Nadi Shodhana balances hormones. Bhramari calms mind. Kapalabhati (gentle) improves metabolism. Practice 30-45 minutes daily, 5-6 days per week. Combine with: Stress management through meditation. Regular sleep schedule. Healthy diet low in processed foods. Weight management if needed.",
    "benefits": "Regulates menstrual cycles. Balances hormones naturally. Reduces stress affecting PCOS. Aids weight management. Improves insulin sensitivity. Reduces inflammation. Improves fertility. Reduces anxiety and depression common with PCOS.",
    "precautions": "Consult healthcare provider before starting. Practice gently during menstruation. Avoid intense inversions during period. Be patient - hormonal balance takes time. Combine with medical treatment as recommended. Those trying to conceive should inform instructor."
  },
  {
    "id": "yoga_142",
    "title": "Yoga for Arthritis",
    "source": "Therapeutic Yoga",
    "category": "therapeutic",
    "difficulty": "beginner",
    "duration": "varies",
    "info": "Yoga helps manage arthritis through gentle movement and reduced inflammation. Gentle practices: Chair yoga for limited mobility. Warm water yoga/aqua yoga. Gentle range-of-motion movements. Supported poses using props. Never force joints. Beneficial poses: Cat-Cow for spine. Gentle hip circles. Hand and wrist exercises. Ankle rotations. Modified Warrior poses with support. Pranayama reduces stress and inflammation. Important principles: Practice when joints are warmest (often afternoon). Use heat before practice. Move slowly and gently. Never force. Listen to body. Distinguish between muscle stretch (okay) and joint pain (stop). Short frequent sessions better than long ones.",
    "benefits": "Maintains and improves joint mobility. Reduces stiffness. Builds muscle supporting joints. Reduces pain. Decreases inflammation. Improves balance preventing falls. Reduces stress. Improves quality of life. Research shows significant benefit for both osteoarthritis and rheumatoid arthritis.",
    "precautions": "Contraindications: Acute inflammation/flare-ups (rest instead). Always consult rheumatologist before starting. Work with experienced therapeutic yoga teacher. Avoid: Weight-bearing on severely affected joints, extreme ranges of motion, holding poses too long. Modify extensively. Use props liberally."
  },
  {
    "id": "yoga_143",
    "title": "Yoga for Thyroid Health",
    "source": "Endocrine Yoga Therapy",
    "category": "therapeutic",
    "difficulty": "beginner",
    "duration": "varies",
    "info": "Yoga supports thyroid health through poses stimulating thyroid gland and stress reduction. For hypothyroidism (low thyroid): Shoulder stand, plow, fish pose, camel, bridge, bow pose, Ujjayi pranayama. These poses compress/stimulate thyroid. For hyperthyroidism (overactive): Gentle forward bends, child's pose, legs-up-wall, cooling pranayama (Shitali), meditation. Avoid overstimulating poses. Both conditions: Reduce stress through meditation and Yoga Nidra. Pranayama for balance. Jalandhara Bandha (chin lock) in appropriate poses. Practice considerations: Consult endocrinologist. Practice gently. Those with thyroid conditions may have reduced stamina - respect this. Be consistent - practice 20-30 minutes daily.",
    "benefits": "Stimulates sluggish thyroid (hypothyroid). Calms overactive thyroid (hyperthyroid). Regulates metabolism. Reduces stress affecting thyroid. Improves energy levels. Supports weight management. Reduces symptoms like fatigue, anxiety.",
    "precautions": "Contraindications: Thyroid storm (medical emergency). Always work under medical supervision. Don't replace medication with yoga - use as complement. Monitor thyroid levels regularly. Those with hyperthyroid should avoid heating practices. Pregnant women with thyroid conditions need extra caution."
  },
  {
    "id": "yoga_144",
    "title": "Yoga for Migraine Relief",
    "source": "Neurological Yoga Therapy",
    "category": "therapeutic",
    "difficulty": "beginner",
    "duration": "varies",
    "info": "Yoga helps prevent migraines through stress reduction and improved circulation. Preventive practices (between migraines): Gentle forward bends calm nervous system. Legs-up-wall improves circulation. Shoulder and neck releases reduce tension. Pranayama - especially Nadi Shodhana and Bhramari. Regular meditation. During migraine: Rest in dark quiet room. Gentle Shavasana. Ice on forehead. Very gentle pranayama if tolerable. Avoid: Inversions, intense backbends, heating pranayama, bright lights, strong scents. Triggers to avoid: Inconsistent practice schedule. Overexertion. Dehydration. Skipping meals. Regular gentle practice 20-30 minutes daily prevents migraines better than intense occasional practice.",
    "benefits": "Significantly reduces migraine frequency and severity in research studies. Reduces stress triggers. Improves sleep. Reduces muscle tension contributing to migraines. Improves overall well-being. May reduce medication needs (under doctor supervision).",
    "precautions": "Practice preventively between migraines, not during acute attack. Avoid trigger poses. Keep practice gentle and consistent. Stay hydrated. Don't practice in bright light or with strong incense if these trigger migraines. Work with neurologist. Keep migraine diary to identify yoga-related triggers or benefits."
  },
  {
    "id": "yoga_145",
    "title": "Yoga for Asthma Management",
    "source": "Respiratory Yoga Therapy",
    "category": "therapeutic",
    "difficulty": "beginner",
    "duration": "varies",
    "info": "Yoga improves lung function and reduces asthma symptoms. Beneficial practices: Pranayama is most important - Ujjayi, Nadi Shodhana, gentle Kapalabhati. Three-part breath improves lung capacity. Chest-opening poses: Cobra, Bridge, Camel, Fish. Supported backbends. Shoulder mobility work. Meditation reduces stress triggering asthma. Important guidelines: Always have rescue inhaler nearby. Practice in clean air environment. Avoid: Intense breath retention, Bhastrika pranayama, cold air breathing, overly strenuous practice. Practice when breathing is stable, not during attack. Breathing should always be through nose when possible. Research shows yoga significantly improves asthma control and quality of life.",
    "benefits": "Improves lung function and capacity. Reduces asthma attack frequency and severity. Decreases need for rescue inhaler. Strengthens respiratory muscles. Reduces anxiety about breathing. Improves stress management. May reduce long-term medication needs under medical supervision.",
    "precautions": "Contraindications: Acute asthma attack (seek medical care). Always consult pulmonologist. Keep rescue inhaler accessible. Stop if breathing becomes difficult. Don't practice in dusty, moldy, or allergen-rich environments. Avoid incense or strong scents if sensitive. Never replace medications with yoga - use as complement."
  },
  {
    "id": "yoga_146",
    "title": "Using Props - Yoga Blocks",
    "source": "Iyengar Yoga Tradition",
    "category": "props",
    "difficulty": "beginner",
    "duration": "N/A",
    "info": "Yoga blocks are versatile props that bring the floor closer and provide support. Uses: Triangle Pose - place block under lower hand if can't reach floor. Forward Bends - stack blocks under hands or forehead. Seated poses - sit on block to elevate hips if tight. Bridge Pose - place block under sacrum for supported version. Crow Pose - place block under forehead when learning. Standing Forward Fold - rest hands on blocks. Restorative poses - support body in relaxation. Block heights: Three heights available - use lowest for less support, highest for more. Common mistake: thinking blocks are for beginners only - experienced practitioners use blocks to deepen practice and maintain alignment.",
    "benefits": "Makes poses accessible. Maintains proper alignment. Prevents injury from forcing. Allows longer holds in restorative poses. Helps develop strength gradually. Supports body while building flexibility. Essential for safe practice.",
    "precautions": "Choose firm blocks that don't compress. Cork or foam both work well. Ensure block is stable before putting full weight on it. Don't use as substitute for developing flexibility - use while working toward full pose."
  },
  {
    "id": "yoga_147",
    "title": "Using Props - Yoga Straps",
    "source": "Iyengar Yoga Tradition",
    "category": "props",
    "difficulty": "beginner",
    "duration": "N/A",
    "info": "Yoga straps extend reach and assist with alignment. Uses: Seated Forward Bend - loop around feet if can't reach. Cow Face Pose - hold strap between hands if they don't meet. Reclining Hand-to-Big-Toe - loop around foot. Shoulder stretches - hold strap between hands to open shoulders. King Dancer - loop around back foot. Bound poses - use instead of binding hands. Gomukhasana arms - connect hands via strap. How to use: Make loops by threading strap through buckle. Adjust length as needed. Hold firmly but don't create tension. Strap should assist, not force. Length: 6-8 feet is standard. Longer straps offer more versatility.",
    "benefits": "Makes poses accessible while maintaining alignment. Helps develop flexibility safely. Prevents compensating with poor form. Allows proper muscle engagement. Enables longer holds. Supports gradual progression. Excellent for tight shoulders and hamstrings.",
    "precautions": "Don't use strap to force body into position. Should assist, not pull. If strap causes pain, adjust position. Ensure buckle is secure. Don't wrap so tightly that it cuts circulation."
  },
  {
    "id": "yoga_148",
    "title": "Using Props - Bolsters",
    "source": "Restorative Yoga",
    "category": "props",
    "difficulty": "beginner",
    "duration": "N/A",
    "info": "Bolsters provide firm support for restorative poses. Uses: Supported Child's Pose - hug bolster lengthwise. Supported Fish Pose - place under spine. Legs-up-Wall - place under hips. Savasana - under knees or behind knees. Supported Forward Bend - over bolster on thighs. Supported Twist - hugging bolster while twisted. Prenatal yoga - provides essential support. Meditation - sit on for elevation. Types: Rectangular or cylindrical. Rectangular more versatile. Cylindrical better for certain backbends. Should be firm but comfortable. Cover with blanket for extra softness.",
    "benefits": "Essential for restorative yoga practice. Allows complete relaxation. Supports body so muscles can release. Enables holding poses longer. Therapeutic for stress, anxiety, fatigue. Supports prenatal practice. Makes yoga accessible for those with injuries or limitations.",
    "precautions": "Bolster should be firm enough to provide stable support. Cover if fabric irritates skin. Ensure bolster is positioned to support, not create strain. Clean covers regularly."
  },
  {
    "id": "yoga_149",
    "title": "Using Props - Blankets",
    "source": "Traditional Yoga",
    "category": "props",
    "difficulty": "beginner",
    "duration": "N/A",
    "info": "Blankets are the most versatile yoga prop. Uses: Shoulder Stand - folded under shoulders to protect neck. Seated poses - folded to elevate hips. Savasana - cover body for warmth, under knees for back support. Restorative poses - create cushioning and support. Kneeling poses - pad knees. Child's Pose - under hips or forehead. Bolster substitute - roll tightly. Eye pillow substitute - fold over eyes. Meditation - sit on or wrap for warmth. How to fold: Different folds create different heights. Firm blankets hold shape better. Stack multiple blankets for more height.",
    "benefits": "Extremely versatile and affordable. Provides customizable support. Essential for protecting neck in shoulder stand. Makes seated meditation comfortable. Adds warmth in Savasana. Pads joints. Can substitute for other props. Every yoga practitioner should have 2-3 blankets.",
    "precautions": "Use yoga blankets or firm blankets - not soft fluffy blankets that compress too much. Ensure blankets are clean. Fold evenly for stable support. Secure rolled blankets so they don't unroll during practice."
  },
  {
    "id": "yoga_150",
    "title": "Chair Yoga - Seated Mountain Pose",
    "source": "Accessible Yoga",
    "category": "chair_yoga",
    "difficulty": "beginner",
    "duration": "1-2 minutes",
    "info": "Chair yoga makes practice accessible for those who cannot practice on floor. Seated Mountain Pose is foundation. Sit toward front edge of chair, feet flat on floor hip-width apart. Knees directly over ankles. Sit tall, lengthening spine. Roll shoulders back and down. Rest hands on thighs or knees. Close eyes or gaze softly forward. Breathe naturally, feeling stable like a mountain. This is starting position for many chair yoga poses. Hold 1-2 minutes, establishing proper alignment and breath awareness.",
    "benefits": "Improves posture. Strengthens back and core. Accessible for all levels. Safe for those with balance issues, joint problems, or limited mobility. Can be practiced at office. Develops body awareness. Grounds and centers mind.",
    "precautions": "Use sturdy chair without wheels. Feet should reach floor - use blocks under feet if needed. Don't slouch - maintain length in spine. Suitable for elderly, those with disabilities, office workers, pregnant women, anyone who needs extra support."
  },
  {
    "id": "yoga_151",
    "title": "Mula Bandha - Root Lock",
    "source": "Advanced Hatha Yoga",
    "category": "bandha",
    "difficulty": "advanced",
    "duration": "varies",
    "info": "Mula Bandha is engagement of pelvic floor muscles. How to practice: Sit comfortably in meditation pose. Exhale completely. Gently contract and lift pelvic floor muscles (between anus and genitals). The sensation is like stopping urination midstream, but more subtle. Hold the lift while breathing normally. Start with a few seconds, gradually increasing. Can be practiced with or without breath retention. Often combined with asana practice. In poses, engage Mula Bandha to support core and protect lower back. Should be subtle, not forceful contraction.",
    "benefits": "Supports pelvic organs. Strengthens pelvic floor. Protects lower back in poses. Directs energy upward through spine. Essential for advanced pranayama. Improves continence. Enhances sexual health. Supports meditation by containing energy. Therapeutic for some pelvic floor issues.",
    "precautions": "Learn from experienced teacher initially. Don't force or over-contract. Those with pelvic floor dysfunction should work with pelvic floor therapist. Pregnant women should practice gently and with guidance. Not recommended during menstruation by some traditions. If causes tension or pain, release."
  },
  {
    "id": "yoga_152",
    "title": "Uddiyana Bandha - Upward Flying Lock",
    "source": "Advanced Hatha Yoga",
    "category": "bandha",
    "difficulty": "advanced",
    "duration": "varies",
    "info": "Uddiyana Bandha is abdominal lock engaging deep core muscles. How to practice: Stand with feet hip-width, knees slightly bent, hands on thighs. Inhale deeply, then exhale completely. Without inhaling, pull abdomen in and up under ribcage. Hold the lock for comfortable duration. Before inhaling, release the lock. Inhale slowly. This should be practiced on completely empty stomach. Can also be done seated. Often practiced with breath retention (after exhalation). Creates visible 'scooping' of abdomen.",
    "benefits": "Massages abdominal organs. Strengthens diaphragm and abdominal muscles. Improves digestion. Stimulates solar plexus. Prepares for advanced pranayama. Increases energy. Supports metabolic function. Tones core deeply. Therapeutic for digestive issues.",
    "precautions": "Contraindications: Pregnancy, menstruation, high blood pressure, heart disease, hernia, ulcers, recent abdominal surgery, glaucoma. MUST practice on empty stomach. MUST learn from qualified teacher. Never force. Those with digestive problems should practice very gently. Don't practice during menstruation."
  },
  {
    "id": "yoga_153",
    "title": "Jalandhara Bandha - Chin Lock",
    "source": "Advanced Hatha Yoga",
    "category": "bandha",
    "difficulty": "advanced",
    "duration": "varies",
    "info": "Jalandhara Bandha is throat lock used with pranayama and some asanas. How to practice: Sit in comfortable meditation pose. Inhale deeply and hold breath (or sometimes after exhaling). Lower chin toward sternum, lengthening back of neck. Slightly draw chest toward chin. The lock creates gentle pressure on throat. Hold for comfortable duration with retained breath. Before breathing, release chin lock. Used in: Shoulder Stand (naturally occurring), pranayama with breath retention, some meditation practices. Creates seal that contains energy in torso.",
    "benefits": "Regulates blood pressure during breath retention. Massages thyroid and parathyroid. Calms mind. Essential for safe breath retention practices. Stimulates throat chakra. Enhances pranayama effects. Protects brain during advanced practices.",
    "precautions": "Contraindications: Neck injury, cervical spondylosis, high blood pressure, heart disease, vertigo. Don't force chin down. Should be comfortable. Those with neck problems should practice very gently or avoid. Not recommended during pregnancy. Must learn proper technique from teacher before practicing with breath retention."
  },
  {
    "id": "yoga_154",
    "title": "Jala Neti - Nasal Cleansing",
    "source": "Hatha Yoga Kriyas",
    "category": "kriya",
    "difficulty": "intermediate",
    "duration": "5-10 minutes",
    "info": "Jala Neti is nasal irrigation using warm saline water. Equipment needed: Neti pot (ceramic or plastic). How to practice: Fill neti pot with lukewarm water mixed with non-iodized salt (1/4 to 1/2 teaspoon per cup). Lean over sink, tilt head to side. Insert spout of neti pot in upper nostril. Breathe through mouth. Water flows through upper nostril, out lower nostril. Use half pot on one side, then switch. After both sides, gently blow nose. Practice in morning, on empty stomach. Frequency: Daily during allergy season, weekly for maintenance.",
    "benefits": "Clears nasal passages. Reduces sinus infections. Alleviates allergies. Improves breathing for pranayama. Prevents colds. Removes mucus and debris. Moisturizes nasal passages. Improves sense of smell. Reduces snoring. Helps with headaches.",
    "precautions": "MUST use distilled, boiled (then cooled), or filtered water - never tap water. Use correct salt ratio - too little burns, too much irritates. Don't practice with severe nasal congestion, ear infection, or nosebleed. Dry nose completely after practice. If water goes in ear, not in nose - adjust head angle. Some people need guidance initially. Consult doctor if you have chronic sinus issues."
  },
  {
    "id": "yoga_155",
    "title": "Trataka - Steady Gazing Meditation",
    "source": "Meditation Practices",
    "category": "meditation",
    "difficulty": "beginner",
    "duration": "5-20 minutes",
    "info": "Trataka is focused gazing meditation, usually on candle flame. How to practice: Sit comfortably at eye level with candle flame, about arm's length away. Gaze steadily at flame without blinking for as long as comfortable (start with 30-60 seconds). When eyes water or strain, close them. Visualize flame at third eye center (between eyebrows). When visualization fades, open eyes and repeat. Practice 5-20 minutes. Variations: Can use dot on wall, yantra, deity image, flower, or other object instead of flame. Practice in dark or dim room for candle, well-lit room for other objects.",
    "benefits": "Dramatically improves concentration and focus. Strengthens eyes and eye muscles. Clears mind. Develops mental stability. Improves visualization abilities. Enhances meditation. Prepares for deeper practices. Helps with insomnia. Calms mental chatter. Awakens third eye chakra.",
    "precautions": "Contraindications: Serious eye problems, glaucoma, epilepsy (if using flame). Don't strain eyes - blink if needed. If eyes hurt, practice for shorter duration. Those with eye problems should consult ophthalmologist. Keep candle at safe distance and in stable holder. Ensure room is ventilated. Don't practice if eyes are inflamed or infected."
  },
  {
    "id": "yoga_156",
    "title": "Loving-Kindness Meditation (Metta)",
    "source": "Buddhist Yoga Tradition",
    "category": "meditation",
    "difficulty": "beginner",
    "duration": "10-20 minutes",
    "info": "Metta meditation cultivates unconditional love and compassion. How to practice: Sit comfortably, close eyes. Begin with yourself: 'May I be happy, may I be healthy, may I be safe, may I live with ease.' Feel the meaning, not just words. Repeat several times. Then extend to loved one: 'May you be happy...' Then neutral person (someone you don't know well). Then difficult person (someone you have conflict with). Finally all beings: 'May all beings be happy...' Spend a few minutes on each category. Variations: Can use different phrases. Can visualize people as you offer them well-wishes.",
    "benefits": "Reduces anger and resentment. Increases compassion and empathy. Improves relationships. Reduces anxiety and depression. Increases positive emotions. Improves self-love and acceptance. Reduces judgment of others. Supported by extensive research. Changes brain structure (increases gray matter in emotional regulation areas).",
    "precautions": "Some people find it challenging to send love to themselves or difficult people - this is normal. Start where it's comfortable. Don't force feelings - just offer the words sincerely. If strong emotions arise, practice self-compassion. Those with trauma may need to work with therapist while practicing."
  },
  {
    "id": "yoga_157",
    "title": "Body Scan Meditation - Detailed Practice",
    "source": "Mindfulness Meditation",
    "category": "meditation",
    "difficulty": "beginner",
    "duration": "20-45 minutes",
    "info": "Body scan develops profound body awareness and relaxation. How to practice: Lie in Shavasana or sit comfortably. Close eyes. Bring attention to breath for a few minutes. Begin at toes of right foot. Notice sensations - warmth, coolness, tingling, pressure, or nothing. Don't judge, just observe. Move attention slowly up: sole of foot, top of foot, ankle, lower leg, knee, thigh, hip. Repeat on left side. Then: pelvis, lower back, abdomen, mid-back, chest, shoulders, upper back, arms (fingers to shoulders), neck, face (jaw, lips, nose, eyes, forehead), top of head. Finish with whole body awareness. If mind wanders, gently return to body. This is normal and part of practice.",
    "benefits": "Develops profound body awareness. Releases physical tension. Calms nervous system. Improves sleep. Reduces chronic pain. Treats anxiety and PTSD. Develops mindfulness. Helps identify where you hold stress. Improves interoception (awareness of internal body states). Supported by extensive research for pain and stress.",
    "precautions": "Very safe practice. Some people fall asleep - this is okay initially but try to maintain awareness. If trauma arises, open eyes and ground yourself (feel feet on floor, notice surroundings). Those with trauma history may need to practice with eyes open or with therapist guidance. Can be practiced anytime."
  },
  {
    "id": "yoga_158",
    "title": "Walking Meditation",
    "source": "Buddhist Meditation",
    "category": "meditation",
    "difficulty": "beginner",
    "duration": "10-30 minutes",
    "info": "Walking meditation combines movement with mindfulness. How to practice: Choose path about 20-30 feet long (or circle). Stand at one end, feet hip-width apart. Bring attention to body standing. Begin walking very slowly. Notice: Lifting foot, moving foot forward, placing foot down, shifting weight. Feel each sensation. Walk to end of path, pause, turn, continue. Keep gaze lowered few feet ahead. If mind wanders, note 'thinking' and return to sensations of walking. Can walk at natural pace once comfortable with slow version. Can practice anywhere - in nature, at home, even in hallways.",
    "benefits": "Develops mindfulness through movement. Accessible for those who find sitting meditation difficult. Improves balance and body awareness. Calms mind while energizing body. Excellent for those who feel restless sitting. Can be practiced throughout day. Reduces anxiety. Improves presence and grounding.",
    "precautions": "Practice on safe, even surface. If balance is an issue, practice near wall or with walking stick. Can be done at any pace. Very safe practice. Those with mobility issues can modify - even slow wheelchair movement can be walking meditation. Don't practice where you might walk into obstacles."
  },
  {
    "id": "yoga_159",
    "title": "Vata Dosha - Yoga Practice",
    "source": "Ayurvedic Yoga",
    "category": "ayurveda",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Vata dosha (air + space elements) governs movement and change. Characteristics when balanced: Creative, enthusiastic, flexible, quick thinking. When imbalanced: Anxious, scattered, insomnia, irregular digestion, dry skin, cold extremities. Yoga for Vata: Grounding, warming, calming practices. Slow, steady movements. Hold poses longer. Focus on stability and routine. Recommended: Slow Hatha or Yin yoga. Grounding poses - Mountain, Warrior, Tree. Hip openers. Forward bends. Restorative poses. Warming pranayama - Ujjayi, gentle Kapalabhati. Meditation focusing on grounding. Practice at same time daily. Warm environment. Avoid: Fast-paced Vinyasa, excessive movement, cold environments.",
    "benefits": "Balances Vata dosha. Reduces anxiety and fear. Improves sleep. Grounds scattered energy. Warms body. Establishes routine. Calms nervous system. Improves digestion. Helps Vata types feel stable and secure.",
    "precautions": "Vata types should not over-practice - this depletes rather than nourishes. Need consistency more than intensity. Should practice in warm environment. Need extra rest and restoration. Oil massage before yoga is beneficial."
  },
  {
    "id": "yoga_160",
    "title": "Pitta Dosha - Yoga Practice",
    "source": "Ayurvedic Yoga",
    "category": "ayurveda",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Pitta dosha (fire + water elements) governs transformation and metabolism. Characteristics when balanced: Intelligent, focused, driven, good digestion. When imbalanced: Angry, irritable, inflammatory conditions, acid reflux, skin rashes, excessive heat. Yoga for Pitta: Cooling, calming, surrendering practices. Moderate intensity. Practice with ease, not competition. Recommended: Moderate-paced practice, not overly vigorous. Forward bends (cooling). Twists (release heat). Hip openers. Avoid headstands (too heating). Cooling pranayama - Shitali, Nadi Shodhana. Practice in cool environment or early morning. Emphasize surrender and letting go. Avoid: Hot yoga, excessive competition, practicing in heat, over-achievement in practice.",
    "benefits": "Balances Pitta dosha. Reduces anger and irritation. Cools body and mind. Releases need for perfection. Improves digestion. Reduces inflammation. Helps Pitta types relax and surrender. Softens intensity.",
    "precautions": "Pitta types can overdo practice due to competitive nature - need to practice moderation. Should avoid practice in hot environments. Need to let go of achievement and perfection. Evening practice often better than midday for Pittas."
  },
  {
    "id": "yoga_161",
    "title": "Kapha Dosha - Yoga Practice",
    "source": "Ayurvedic Yoga",
    "category": "ayurveda",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Kapha dosha (earth + water elements) governs structure and lubrication. Characteristics when balanced: Calm, stable, strong, compassionate, steady. When imbalanced: Lethargic, depressed, weight gain, congestion, resistant to change. Yoga for Kapha: Energizing, heating, stimulating practices. Vigorous movement. Challenge and variety. Recommended: Vigorous Vinyasa or Power yoga. Sun Salutations (multiple rounds). Standing poses held dynamically. Backbends (energizing). Arm balances. Heating pranayama - Kapalabhati, Bhastrika. Practice in morning. Vary routine to avoid stagnation. Avoid: Slow, restorative practices (too sedating for Kapha). Excessive comfort. Long holds in seated poses.",
    "benefits": "Balances Kapha dosha. Increases energy and motivation. Reduces congestion. Aids weight loss. Stimulates metabolism. Overcomes lethargy and depression. Helps Kapha types embrace change and movement. Prevents stagnation.",
    "precautions": "Kapha types may resist starting practice but benefit greatly once they do. Need stimulation and variety to maintain interest. Should avoid excessive comfort - challenge is beneficial. Morning practice essential for Kaphas. Fasting or light eating before practice is good for Kapha."
  },
  {
    "id": "yoga_162",
    "title": "Sattvic Lifestyle - Yoga Philosophy",
    "source": "Yoga Philosophy",
    "category": "philosophy",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Sattva is the quality of purity, harmony, and balance. Sattvic lifestyle supports yoga practice and spiritual growth. Sattvic foods: Fresh fruits and vegetables. Whole grains. Nuts and seeds. Fresh dairy (milk, ghee). Honey. Herbal teas. Foods prepared with love. Sattvic activities: Yoga and meditation. Service to others. Study of uplifting texts. Spending time in nature. Creative expression. Harmonious relationships. Adequate sleep. Sattvic qualities: Clarity, peace, compassion, contentment, truthfulness, non-violence. Avoid: Excessive rajasic (stimulating) or tamasic (dulling) influences. The goal is moderation and balance, not rigidity.",
    "benefits": "Creates clarity of mind. Supports spiritual development. Improves meditation. Promotes peace and contentment. Enhances intuition. Supports physical health. Creates harmonious relationships. Sustainable, balanced approach to life.",
    "precautions": "Sattvic lifestyle is a ideal to work toward, not rigid rules. Be compassionate with yourself. Cultural and individual differences are respected. The key is intention toward harmony and purity, not perfection."
  },
  {
    "id": "yoga_163",
    "title": "Koshas - The Five Sheaths",
    "source": "Vedanta Philosophy",
    "category": "philosophy",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "The koshas are five layers or sheaths of being, from gross to subtle. 1) Annamaya Kosha (Food Sheath): Physical body. Addressed through: Asana, healthy diet, sleep. 2) Pranamaya Kosha (Energy Sheath): Vital energy, breath. Addressed through: Pranayama, energy work. 3) Manomaya Kosha (Mental Sheath): Thoughts, emotions, sensory mind. Addressed through: Meditation, mindfulness, emotional work. 4) Vijnanamaya Kosha (Wisdom Sheath): Intellect, intuition, witness consciousness. Addressed through: Self-inquiry, study, meditation. 5) Anandamaya Kosha (Bliss Sheath): Innermost layer, pure being, connection to source. Addressed through: Deep meditation, devotion, surrender. Beyond koshas is the true Self (Atman). Yoga practice systematically works through layers, moving from gross to subtle.",
    "benefits": "Understanding koshas provides framework for holistic practice. Helps identify where imbalances exist. Shows path to deeper awareness. Explains how different practices work. Supports integration of physical, mental, emotional, and spiritual aspects.",
    "precautions": "This is conceptual framework, not rigid boxes. Koshas interpenetrate and influence each other. Different traditions describe slightly differently. Use as map, not territory. Direct experience through practice is most important."
  },
  {
    "id": "yoga_164",
    "title": "Karma Yoga - The Yoga of Action",
    "source": "Bhagavad Gita",
    "category": "philosophy",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Karma Yoga is the path of selfless action and service. Core principles: 1) Perform your duty (dharma) to best of ability. 2) Act without attachment to results. 3) Offer actions as service to divine or greater good. 4) Work becomes worship. Key teaching: 'You have right to perform your duty, but not to fruits of action.' Freedom comes from letting go of outcome while doing your best. Modern application: Work done with excellence but without obsession over results. Volunteer service (seva). Parenting. Any action done with selfless intention. The goal is purification of mind and ego through dedicated action. This is yoga practice off the mat.",
    "benefits": "Reduces stress and anxiety about outcomes. Transforms daily activities into spiritual practice. Reduces ego and self-centeredness. Creates sense of purpose. Develops equanimity in success and failure. Makes work fulfilling. Accessible path for those with active lives.",
    "precautions": "Karma Yoga doesn't mean not caring about quality - it means doing your best without attachment. Not excuse for inaction or poor effort. Balance with other yoga paths. Can be misunderstood as martyrdom - healthy boundaries important."
  },
  {
    "id": "yoga_165",
    "title": "Bhakti Yoga - The Yoga of Devotion",
    "source": "Devotional Yoga Traditions",
    "category": "philosophy",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Bhakti Yoga is the path of love and devotion to the divine. Practices: Chanting (kirtan). Prayer. Devotional meditation. Reading sacred texts. Ritual worship (puja). Seeing divine in all beings. Service as worship. Core principle: Love and devotion transform consciousness. The beloved (divine) can take any form - deity, guru, nature, humanity, formless absolute. Nine forms of bhakti: Listening, singing, remembering, serving, worshipping, prostrating, friendship, complete surrender. Emotion and heart are primary, not just intellect. Modern application: Can be devotion to truth, love, service, or any higher principle, not necessarily theistic.",
    "benefits": "Opens heart and cultivates love. Transforms negative emotions through devotion. Creates surrender and trust. Very accessible - uses natural human capacity for love. Reduces ego. Creates joy and bliss. Fulfills emotional needs. Supported by community (sangha).",
    "precautions": "True bhakti is transformation through love, not blind belief. Healthy devotion empowers, unhealthy creates dependency. Choose teachers and paths wisely. Can be combined with other yoga paths. Emotion alone isn't enough - wisdom also needed."
  },
  {
    "id": "yoga_166",
    "title": "Jnana Yoga - The Yoga of Knowledge",
    "source": "Vedanta Philosophy",
    "category": "philosophy",
    "difficulty": "knowledge",
    "duration": "N/A",
    "info": "Jnana Yoga is the path of wisdom and self-inquiry. Core practice: Discrimination between real and unreal, permanent and temporary. Self-inquiry: 'Who am I?' Investigation of true nature beyond body and mind. Four qualifications: 1) Discrimination (viveka), 2) Dispassion (vairagya), 3) Six virtues (tranquility, self-control, withdrawal, forbearance, faith, focus), 4) Intense longing for liberation. Methods: Study of scriptures (Upanishads, Brahma Sutras, Bhagavad Gita). Contemplation. Meditation on 'I am not this body, I am not these thoughts.' Recognition of unity of individual and universal consciousness. This is considered challenging path requiring intellectual capacity and emotional maturity.",
    "benefits": "Leads to direct knowledge of true nature. Liberates from identification with limited self. Develops discrimination and wisdom. Answers fundamental questions of existence. Brings lasting peace beyond temporary happiness. Most direct path to self-realization.",
    "precautions": "Can become too intellectual without heart development. Should be balanced with devotion and action. Requires qualified teacher. Can lead to spiritual bypassing if used to avoid emotions or responsibilities. Best when all four yoga paths are integrated."
  }
]